{"appId":"ac.mdiq.podcini.X","appShortcutName":"Podcini.X - Podcast instrument","appDisplayName":"Podcini.X - Podcast instrument","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Xilin Jia/https://github.com/XilinJia/Podcini.X/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Modern, feature-rich, without access to Youtube\nPodcini, an open source podcast instrument, attuned to Puccini, adorned with pasticcini and aromatized with porcini, invites your harmonious heartbeats.\n\nDo I hear your heartbeats?  Great!\n\nCommon functionalities of a podcast player are well-supported:\n<ul>\n<li>Search, discover and subscribe to podcasts, by keywords, simple RSS URLs, or OPML files.</li>\n<li>Download, stream or queue episodes, and enjoy them the way you like with adjustable playback speeds.</li>\n<li>Save effort, battery power and mobile data usage with powerful automation controls for downloading episodes.</li>\n<li>If the feed contains no media (plain RSS feed), Text-to-Speech engine is used to play the text.</li>\n<li>Listening progress can be instantly synced through a NextCloud server or across devices in the same Wi-Fi network without a server.</li>\n</ul>\n\nSo what's special with this podcast app among the many?\n\nWell, aside from doing the above well, the following make it stand out:\n<ol>\n<li>It's open sourced, free to use and free of ads, free as in beer and free as in speech!</li>\n<li>It takes advantage of modern frameworks to be efficient and conserve energy.</li>\n<li>In addition to subscriptions, it allows you to create your own synthetic podcasts to compile your interested episodes from various podcasts to better focus on your interests.</li>\n<li>While the list of episodes (filtered and sorted by you) in each podcast serves a natural playlist for you, it also empowers you with multiple queues each associable with any podcasts to group similar contents for better listening.</li>\n<li>On any podcast/episode, you can assign 5 levels of rating allowing you to make better decisions on where to put your attention.</li>\n<li>You have 12 levels of play states (like to play soon, add in queue, or play again) to better plan and record your listening experiences.</li>\n<li>You can also keep your personal notes with your opinions/comments on each podcast/episode.</li>\n<li>It has sophisticated sorting and filtering options for you to better select contents.</li>\n<li>Sure, you can play any episodes in your car's speakers.</li>\n<li>And, it's not all about audio, video is well handled.</li>\n<li>You can cast the audio/video to Chromecast speakers/screens.</li>\n</ol>\n\nSome other podcast players can also do all of the above?\n\n<b>Join the Podcini community!</b>\n\nPodcini is under active development by volunteers.\nYou can contribute too, with code, comments or improvements.\nSee source code on <a href=\"https://github.com/XilinJia/Podcini.X\">github.com/XilinJia/Podcini.X</a>\n","repo":{"author":"Xilin Jia","repo":"https://github.com/XilinJia/Podcini.X"},"version":"d5c1e89215f0e82faf8d981a14d7cd980107b69f937cebdd32f441441840aac7","site":null,"source":"https://github.com/XilinJia/Podcini.X","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}