{"appId":"app.simple.peri","appShortcutName":"Peristyle","appDisplayName":"Peristyle","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Hamza Rizwan/https://github.com/Hamza417/Peristyle/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple wallpaper manager app with Auto Wallpaper and Multi Folder support.\nPeristyle is created to be extremely simple and sophisticated wallpaper manager and browser app for Android. It solves the problem of having too many features and bloated apps and having very minimal support for locally stored wallpapers. What if you just wanted an app that allows you to browse and select your own locally stored wallpapers and lets you manage and set wallpapers from there? then Peristyle is for you :)\n\nFeatures:\n\n- Simple architecture, browse wallpapers and use system wallpaper manager to set them as wallpaper.\n- Multiple folders support.\n- Ability to assign Tags to any wallpaper.\n- Can scan .nomedia directories, useful if you want to keep your wallpapers away from gallery.\n- Apply blur and color filters dynamically on any wallpaper before applying.\n- Simple yet pretty animations with proper optimizations.\n- Compress or reduce images on the fly.\n- No ads, no tracking, no analytics, no internet permissions, no unnecessary permissions.\n- Auto wallpaper change support with dedicated folders and tags for each screens.\n- Change wallpaper using app's live wallpaper\n- Edit and apply filters on wallpapers losslessly in realtime.\n- Built-in live wallpaper picker.\n- Dark mode support.\n- Glassmorphic UI based on realtime blur effects and caustic shadows.\n- Material You color theme.\n- Fully reproducible build.\n- Zero loading software architecture.\n","repo":{"author":"Hamza Rizwan","repo":"https://github.com/Hamza417/Peristyle"},"version":"9bc67707f318767eab9ff0329eda1a836e1f9b4fe1a5bc6f9a88df47ca3cba0b","site":null,"source":"https://github.com/Hamza417/Peristyle","license_or_tos":"Apache-2.0","resources":null,"verified":false}