{"appId":"app.mlauncher","appShortcutName":"mLauncher - Minimal and Clutter Free launcher","appDisplayName":"mLauncher - Minimal and Clutter Free launcher","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/DroidWorksStudio/https://github.com/DroidWorksStudio/mLauncher/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Forked from mLauncher, +minimalization, +customizability\n<p>Forked from <a href=\"https://github.com/tanujnotes/Olauncher\">Olauncher</a>: A minimal and clean launcher with\n    enhanced features.</p>\n\n<h2>Forked with Extra Features</h2>\n\n<b>Features:</b>\n\n- App Drawer Customization: Rename apps in the app drawer (home screen app renaming is already supported with a long\nclick).\n- Advanced Gestures: A wide range of gestures, including taps and swipes, to trigger different actions.\n- Clock Customization: Position the clock independently of the home apps, giving more control over your home screen\nlayout.\n- App Drawer Layout: Change the alignment of apps in the app drawer independently of the home screen.\n- Font Size Customization: Adjust the font size of sections of the home screen separately.\n- Privacy Focused: Removed internet permission, ensuring your data remains private.\n- Biometric Security: Lock settings behind biometric authentication (toggle option).\n- Crash Reports: Ability to report crashes via email for better troubleshooting.\n- App Usage Tracking: View app usage time directly from the home screen.\n\n<b>Gestures Include:</b>\n\n- Double Tap: Quickly tap twice to trigger a predefined action.\n- Clock Tap: Tap the clock to access additional features or settings.\n- Date Tap: Tap the date for easy access to the calendar.\n- Usage Tap: Tap on the total usage to view system or app usage data.\n- Short Swipes: Swipe up, down, left, or right to navigate or trigger different actions.\n- Long Swipes: Swipe up, down, left, or right for additional gesture actions.\n\n<b>Possible Actions Include:</b>\n\n- Open Specified App: Instantly open any app of your choice with a gesture.\n- Display App List: Show the full list of apps installed on the device.\n- Lock Screen: Lock your device for security.\n- Show Recently Opened Apps: Access recently used apps for quick multitasking.\n- Open Notification Drawer: Trigger the notification drawer with a swipe or tap.\n- Open Quick Settings: Access quick settings directly from the home screen.\n- Power Dialog: Open power options like shutdown, restart, and more.\n- Take a Screenshot: Capture the screen to save or share your content.\n- Switch Page: Quickly switch between home screen pages.\n- Disable Gesture: Disable specific gestures as needed.\n\n<b>Translations:</b>\n\n- Arabic\n- Dutch\n- English\n- French\n- German\n- Hebrew\n- Italian\n- Japanese\n- Korean\n- Lithuanian\n- Polish\n- Portuguese\n- Russian\n- Slovak\n- Spanish\n- Thai\n- Turkish","repo":{"author":"DroidWorksStudio","repo":"https://github.com/DroidWorksStudio/mLauncher"},"version":"ef44f87e75f6b4f6e66c65b96ab0748d13ca6b1466d4f13394a8bfdcac8cf144","site":null,"source":"https://github.com/DroidWorksStudio/mLauncher","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}