{"appId":"ardash.doodledudette","appShortcutName":"Doodle Dudette","appDisplayName":"Doodle Dudette","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Andreas Redmer/https://gitlab.com/ar-/doodle-dudette/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Doodle, drawing and painting for children in an Android App\nDiscover a fun and educational experience for your children with this app! This innovative application offers a variety of pre-made drawings that children can color to their heart's content. From cute animals to exciting adventures - there's something suitable for every taste!\n\nFeatures:\n\n* Wide selection of pictures: Our app provides an extensive collection of images for children of all ages and interests. From animal lovers to space adventurers, there are countless opportunities to unleash creativity.\n\n* Easy operation: The user interface is child-friendly and allows little ones to navigate effortlessly between pictures and select their favorite drawings.\n\n* Interactive color selection: With a wide range of colors, children can bring their imagination to life and add a personal touch to their pictures.\n\n* Learning and developmental aspect: Coloring not only promotes artistic creativity but also fine motor skills and children's ability to concentrate.\n\n* Offline access: The app works without an internet connection, so your children can have fun anytime, anywhere.\n\nLet your children dive into a world of colors and fantasy and try the app now!\n\nInternational Age Ratings:\n\n* ACB: G (general)\n* ClassInd: L\n* ESRB: E (everyone)\n* PEGI: 3\n* USK: 0\n* IARC: 3","repo":{"author":"Andreas Redmer","repo":"https://gitlab.com/ar-/doodle-dudette"},"version":"fb51669d1379b997949dcd37dc6f4bd96ee59dea391120387dd5b9924e2a07fd","site":null,"source":"https://gitlab.com/ar-/doodle-dudette","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}