{"appId":"at.tomtasche.reader","appShortcutName":"LibreOffice & OpenOffice document reader | ODF","appDisplayName":"LibreOffice & OpenOffice document reader | ODF","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Thomas Taschauer/https://github.com/opendocument-app/OpenDocument.droid/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Document reader & file editor for Libreoffice & OpenOffice | ODF: ODT, ODS +more\n<h2><b>View and modify documents created using LibreOffice or OpenOffice on the go using the Document Reader & Document Editor!</b></h2>📄🚶\n\nThe file reader & document editor allows you to open files like ODF (Open Document Format) documents created using LibreOffice or OpenOffice wherever you are. In the bus on your way to school wanting to look at your notes before the big exam? No problem! With the Document Reader you can open files wherever you like and read & search through your documents to go in a clean and simple way. Is there just one last typo left to fix in your document before sending it out to colleagues? The File Editor supports modification of documents now! Fast, simple and well integrated.\n\nYou can open files from ODF (ODT, ODS & many more) that you have created with Libre Office or OpenOffice also from within other apps. Supported apps include GMail, Google Drive, iCloud, OneDrive, Nextcloud, Box.net, Dropbox and lots of others! Or use our integrated file explorer instead to open files on your device.\n\n<b>THE ALL IN ONE DOCUMENT READER AND DOCUMENT EDITOR</b> 📄\n\n➡️open files with ODF: ODT (writer), ODS (calc), ODP and ODG without a hassle\n➡️basic editing of documents with the file editor to fix typos, add sentences, etc\n➡️securely open password-protected documents\n➡️search for keywords in your ODT (writer), ODS (calc) or ODG and highlight them\n➡️print documents if your device is connected to a printer\n➡️read your documents in fullscreen to avoid distractions\n➡️select and copy text out of your documents\n➡️enjoy your documents even without internet connectivity - fully offline capable\n➡️read out aloud your documents using Text-To-Speech technology\n\n<b>DOCUMENTS TO GO - WHEREVER YOU LIKE</b> 🚶\n\nIn addition to that, the document reader & document editor aims to support various other file formats as well as possible:\n- Portable Document Format (PDF)\n- Archives: ZIP\n- Images: JPG, JPEG, GIF, PNG, WEBP, TIFF, BMP, SVG, etc\n- Videos: MP4, WEBM, etc\n- Audio: MP3, OGG, etc\n- Text files: CSV, TXT, HTML, RTF\n- Microsoft Office (OOXML): Word (DOC, DOCX), Excel (XLS, XLSX), PowerPoint (PPT, PPTX)\n- Apple iWork: Pages, Numbers, Keynote\n- Libre Office and Open Office ODF (ODT, ODS, ODP, ODG)\n- PostScript (EPS)\n- AutoCAD (DXF)\n- Photoshop (PSD)\n\nThis app is open source. We are not affiliated with OpenOffice, LibreOffice or similar. Made in Austria. Ads are shown in order to support the development of this app. They are free to remove temporarily via the in-app menu. We highly appreciate all kinds of feedback via email.\n\nODF is the format used by office suites like Open Office and Libre Office. Text documents (Writer, ODT), as well as spreadsheets (Calc, ODS) and also presentations (Impress, ODP) are supported, including support with the file editor for complex formatting and embedded images. Graphs are no problem either. If you want to secure your data you can even open password-protected documents. Other applications that are using this format are LibreOffice, OpenOffice, NeoOffice, StarOffice, Go-oo, IBM Workplace, IBM Lotus Symphony, ChinaOffice, AndrOpen Office, Co-Create Office, EuroOffice, KaiOffice, Jambo OpenOffice, MagyarOffice, MultiMedia Office, MYOffice, NextOffice, OfficeOne, OfficeTLE, OOo4Kids, OpenOfficePL, OpenOfficeT7, OxOffice, OxygenOffice, Pladao Office, PlusOffice, RedOffice, RomanianOffice, SunShine Office, ThizOffice, UP Office, White Label Office, WPS Office Storm, Libre Office, Collabora Office and 602Office.","repo":{"author":"Thomas Taschauer","repo":"https://github.com/opendocument-app/OpenDocument.droid"},"version":"1f94d965fd43e6e1b80aa7090a08e89b481805fa41f67b4f0b0a38f270187442","site":null,"source":"https://github.com/opendocument-app/OpenDocument.droid","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}