{"appId":"au.id.colby.nfcquicksettings","appShortcutName":"NFC Quick Settings","appDisplayName":"NFC Quick Settings","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Paul Colby/https://github.com/pcolby/nfc-quick-settings/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"View NFC status, and quickly access NFC settings, from the Quick Settings menu\nNFC Quick Settings is a simple, open source, utility for quickly checking the device's current NFC status, and enabling or disabling NFC with as few taps as possible.\n\nNFC Quick Settings has no user interface of it's own. Instead, once installed, you will see a new \"NFC\" tile available when customising your Quick Settings menu. See \"Add, remove, or move a setting\" in Android Help for more information on customising the Quick Settings menu: https://support.google.com/android/answer/9083864?hl=en#customize_settings\n\nOnce the NFC Quick Settings tile has been added to your Quick Settings menu, the tile will show the current NFC status.\n\nAndroid security limitations do not allow any third-party apps, such as this, to turn NFC on or off directly, so when tapped, the NFC Quick Settings tile will simply open the device's NFC Settings page (if the device has one), where you can enable or disable NFC as desired.\n\nNFC Quick Settings also has an advanced mode that allows NFC to be toggled directly from the tile, without having to going the NFC Settings page. But this advanced mode requires special permissions, which can only be granted via the Android Debug Bridge on a desktop computer. You can read more about this mode at https://github.com/pcolby/nfc-quick-settings?tab=readme-ov-file#advanced-mode\n\nNFC Quick Settings is freely available under the GPLv3 open source license. The source code is available at https://github.com/pcolby/nfc-quick-settings\n","repo":{"author":"Paul Colby","repo":"https://github.com/pcolby/nfc-quick-settings"},"version":"e845b1b6ca7c0b8c114fdc64122fd8cf334c539d1cf021bc96ae7404e5e1c772","site":null,"source":"https://github.com/pcolby/nfc-quick-settings","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}