{"appId":"biz.binarysolutions.stress","appShortcutName":"Perceived Stress Scale","appDisplayName":"Perceived Stress Scale","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Viktor Brešan/https://github.com/vbresan/PerceivedStressScale/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Are you stressed? Take the test to find out how stressed you are.\nThe Perceived Stress Scale (PSS) is the most widely used psychological instrument for measuring the perception of stress. It is a measure of the degree to which situations in one's life are appraised as stressful. Items were designed to tap how unpredictable, uncontrollable, and overloaded respondents find their lives. The scale also includes a number of direct queries about current levels of experienced stress. The PSS was designed for use in community samples with at least a junior high school education. The items are easy to understand, and the response alternatives are simple to grasp. Moreover, the questions are of a general nature and hence are relatively free of content specific to any subpopulation group. The questions in the PSS ask about feelings and thoughts during the last month.\n\nEvidence for Validity: Higher PSS scores were associated with (for example):\n- failure to quit smoking\n- failure among diabetics to control blood sugar levels\n- greater vulnerability to stressful life-event-elicited depressive symptoms\n- more colds\n\nBecause levels of appraised stress should be influenced by daily hassles, major events, and changes in coping resources, predictive validity of the PSS is expected to fall off rapidly after four to eight weeks.","repo":{"author":"Viktor Brešan","repo":"https://github.com/vbresan/PerceivedStressScale"},"version":"60cc2b4b9ba680ee803fa02d628e0dbec449fa6ddd6ee3121f933c2d02341bd9","site":null,"source":"https://github.com/vbresan/PerceivedStressScale","license_or_tos":"MIT","resources":null,"verified":false}