{"appId":"ch.threema.app.libre","appShortcutName":"Threema Libre","appDisplayName":"Threema Libre","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/threema-ch/threema-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Secure and private messaging\nNOTE: A Threema Shop license is required, please visit: https://shop.threema.ch to get one.\n\nThreema is the world’s best-selling secure messenger and keeps your data out of the hands of hackers, corporations, and governments. The service can be used completely anonymously. Threema is open source and offers every feature one would expect from a state-of-the-art instant messenger. The app also allows you to make end-to-end encrypted voice, video, and group calls. Using the desktop app and the web client, you can also use Threema from your desktop.\n\nIn contrast to the version distributed via Google Play, Threema Libre contains no proprietary libraries / components (like Google Play Services).\n\n<strong>PRIVACY AND ANONYMITY</strong>\n\nThreema is designed from the ground up to generate as little data on servers as possible. Group memberships and contact lists are managed on your device only and never stored on our servers. Messages are immediately deleted after they have been delivered. Local files are stored encrypted on your mobile phone or tablet. All this effectively prevents the collection and misuse of your personal information, including metadata. Threema is fully compliant with the European privacy legislation (GDPR).\n\n<strong>ROCK-SOLID ENCRYPTION</strong>\n\nThreema end-to-end encrypts all your communication, including messages, voice and video calls, group chats, files, and even status messages. Only the intended recipient, and nobody else, can read your messages. Threema uses the trusted open source NaCl cryptography library for encryption. The encryption keys are generated and safely stored on the users’ devices to prevent backdoor access or copies.\n\n<strong>COMPREHENSIVE FEATURES</strong>\n\nThreema is not only an encrypted and private messenger but also versatile and feature-rich.\n\n· Write text and send voice messages\n· Edit and delete sent messages on the recipient’s end\n· Make voice, video and group calls\n· Share videos pictures and locations\n· Send any type of file (pdf animated gif, mp3, doc, zip, etc.)\n· Use the desktop app or the web client to chat from your computer\n· Create groups\n· Conduct polls with the poll feature\n· Choose between a dark and a light theme\n· Quickly and silently reply with the unique agree/disagree feature\n· Verify the identity of a contact by scanning their personal QR code\n· Use Threema as anonymous instant messaging tool\n· Synchronize your contacts (optional)\n\n<strong>SERVERS IN SWITZERLAND</strong>\n\nAll our servers are located in Switzerland, and we develop our software in-house.\n\n<strong>FULL ANONYMITY</strong>\n\nEach Threema user receives a random Threema ID for identification. A phone number or email address is not required to use Threema. This unique feature allows you to use Threema completely anonymously – no need to give up private information or to open an account.\n\n<strong>OPEN SOURCE AND AUDITS</strong>\n\nThe source code of the Threema app is open for everyone to review. On top of that, renowned experts are regularly commissioned to conduct systematic security audits of Threema’s code.\n\n<strong>NO ADS, NO TRACKERS</strong>\n\nThreema is not financed by advertising and does not collect user data.\n\n<strong>SUPPORT / CONTACT</strong>\n\nFor questions or problems please consult our FAQs: <a href=\"https://threema.ch/en/faq\">https://threema.ch/en/faq</a>\n","repo":{"author":"Unknown","repo":"https://github.com/threema-ch/threema-android"},"version":"58755762121a2735f55bf65d4da72cf902c35efed9a3c2fbaa8cf69a201a558c","site":null,"source":"https://github.com/threema-ch/threema-android","license_or_tos":"AGPL-3.0-only","resources":null,"verified":false}