{"appId":"chat.jmp.simmanager","appShortcutName":"JMP SIM Manager","appDisplayName":"JMP SIM Manager","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://gitea.angry.im/jmp-sim/jmp-sim-manager/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Companion app for the JMP eSIM Adapter\nJMP SIM Manager is a fully free and open-source companion app for the JMP eSIM Adapter. The JMP eSIM Adapter is a removable eSIM chip that enables any device, not just those with included eSIM chips, to make use of downloadable eSIMs.\n\nJMP SIM Manager provides management features such as adding, deleting, enabling, and disabling eSIM profiles for the adapter, and is the easiest option to manage your eSIM Adapter on compatible Android host devices. The manager app is <strong>not</strong> required once a profile has been downloaded and enabled on the adapter. In other words, you can use a compatible Android device to download your eSIM profile of choice onto the adapter, and then insert the adapter into any device -- Wi-Fi hotspots, dumb phones, laptops -- and the adapter will simply appear as a regular SIM card to those devices.\n\nThis app also includes a quick compatibility check to determine whether your Android device can be used to manage a JMP eSIM Adapter. Although the eSIM Adapter will work with almost any device once an eSIM profile is loaded, management requires some specific features that may not be present on a small percentage of Android devices. However, even if your Android device is deemed incompatible, you can still manage the adapter from another Android device, using a PC/SC reader on a PC, or, as a final fallback, through the SIM Toolkit menu along with a self-hostable remote server to handle TLS termination.","repo":{"author":"Unknown","repo":"https://gitea.angry.im/jmp-sim/jmp-sim-manager"},"version":"feba259609e1342d16e97c80fa64bfd867e1d810ef22110640f00afbe6046fed","site":null,"source":"https://gitea.angry.im/jmp-sim/jmp-sim-manager","license_or_tos":"GPL-2.0-only","resources":null,"verified":false}