{"appId":"co.epitre.aelf_lectures","appShortcutName":"AELF - Bible and day's reading","appDisplayName":"AELF - Bible and day's reading","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Epitre & co/https://github.com/HackMyChurch/aelf-dailyreadings/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A simple and discrete daily reading application\n<b>The Word of God, nothing but the Word of God</b>\n\n* Find the entire Mass and liturgy of the hours from the liturgical translation. Mass, readings, lauds, third, sexte, none, vespers, complies.\n* Meditate on speech, without distractions. Sober and unique full screen display, with no risk of going into standby.\n* Do not look, there is no flourish, no distraction, just the Word.\n\n<b>Accessible, for everyone</b>\n\n* Use your phone, it is compatible. Without sacrificing the look. (Android 2.2+ to Android 5.1)\n* Adjust the text size according to your preferences, depending on your screen.\n* Let us guide you with \"Talkback\". The application is compatible.\n* Read without suffering. The texts are formatted.\n\n<b>Anytime, anywhere</b>\n\n* Automatically synchronize texts to meditate on them even from a cave... or the countryside.\n* Navigate through time, the date is adjustable at least one month in advance.\n\n<b>In a land of trust</b>\n\n* This application uses the Internet for only one thing: to load the texts of the Word. No data other than Android automatic error reports, whether personal or statistical, is transmitted by the application.\n* Application proposed on a voluntary basis, without any publicity with the support of the <i>Association épiscopale liturgique pour les pays francophones</i> (http://www.aelf.org)\n* Texts and logo reproduced with the kind permission of the AELF.","repo":{"author":"Epitre & co","repo":"https://github.com/HackMyChurch/aelf-dailyreadings"},"version":"2c4d1c348d46c67d59d3c03aeed46acdede46f7fbb86525d061f65c554924790","site":null,"source":"https://github.com/HackMyChurch/aelf-dailyreadings","license_or_tos":"MIT","resources":null,"verified":false}