{"appId":"com.buzbuz.smartautoclicker","appShortcutName":"Klick'r - Smart AutoClicker","appDisplayName":"Klick'r - Smart AutoClicker","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Kevin Buzeau/https://github.com/Nain57/Smart-AutoClicker/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Automating clicks based on what is displayed\n<p>Klick'r is an open-source Android application designed to automate repetitive tasks effortlessly. Formerly known as Smart AutoClicker, Klick'r offers unique image detection capabilities alongside traditional auto-clicking functionalities, providing a versatile solution for all your automation needs.\n</p>\n<p>Whether you’re a gamer automating in-game actions, a tester simulating user interactions, or anyone performing repetitive clicking tasks, Klick'r offers both image detection for sophisticated automation and a Regular Mode for straightforward auto-clicking.\n</p>\n\n</br>\n\n## Key Features:\n* **Click and Swipes**: Automate clicks and swipes with precision by configuring press durations, swipe durations, and positions. Trigger actions on detected images to interact seamlessly with dynamic elements.\n* **Advanced Automation**: Enhance your automation scripts with advanced features like counters operations, Android Intents, and flow control, giving you unparalleled flexibility.\n* **Triggers**: Set up sophisticated triggers based on image detection, timers, counters, and Android broadcast receivers to perfectly tailor your automation tasks.\n* **Regular Mode**: Enjoy a straightforward auto-clicking experience with our Regular Mode, designed for easy configuration and ideal for simpler, repetitive tasks.\n* **Tutorials**: Learn to master Klick'r with our interactive game tutorials, which provide step-by-step instructions to help you automate tasks and beat the game using Klick'r's powerful features.\n* **Open Source**: As an open-source project, Klick'r is continuously improved by a dedicated community.","repo":{"author":"Kevin Buzeau","repo":"https://github.com/Nain57/Smart-AutoClicker"},"version":"14a8e6b1d45872ec75c30cd43bb1f5763acae0dd65d0b14af321e1116e5bae2e","site":null,"source":"https://github.com/Nain57/Smart-AutoClicker","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}