{"appId":"com.afkanerd.deku","appShortcutName":"Deku SMS","appDisplayName":"Deku SMS","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Afkanerd/https://github.com/deku-messaging/DekuSMS-Android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Deku is an SMS app that supports end to end encryption and photo sharing\nDeku SMS is a feature-rich, open-source default SMS app designed to enhance your messaging experience while prioritizing your privacy and security. With Deku SMS, you can seamlessly send and receive end-to-end encrypted SMS messages, ensuring that your conversations remain confidential.\n\nOne of the standout features of Deku SMS is its ability to send images over SMS. This is our experimental feature which allows you to share memorable moments or funny pictures. Our goal for this feature is to help communication in areas with limited connectivity but require the need for communicating important documents or images.\n\nIn addition to its privacy and multimedia capabilities, Deku SMS enables users with the option to configure the app to forward their SMS messages to their online servers. This convenient feature ensures that you can access your messages even when you're away from your device, providing you with greater flexibility and convenience in managing your conversations.\n\nKey Features:\n- End-to-end encryption: Protect your SMS conversations with robust encryption, giving you peace of mind that your messages are secure.\n- Image sharing: Easily send and receive images over SMS, making your conversations more engaging and expressive.\n- Message forwarding: Configure the app to forward your SMS messages to your online servers, allowing you to access your messages from any device.\n\nDeku SMS is an open-source project, and we believe in the power of community collaboration. We encourage developers and enthusiasts to explore our codebase on GitHub, where they can contribute to the app's development and customization. We greatly appreciate stars, pull requests, forks and issues. This will greatly help improve the experience for everyone.\n\nVisit our GitHub repository at: https://github.com/deku-messaging/Deku-SMS-Android","repo":{"author":"Afkanerd","repo":"https://github.com/deku-messaging/DekuSMS-Android"},"version":"881d87919295759df83b8daf62df32f45fc1d6057f38faae60f6678b4983d911","site":null,"source":"https://github.com/deku-messaging/DekuSMS-Android","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}