{"appId":"com.maze_squirrel","appShortcutName":"The Squirrel's Maze 2D","appDisplayName":"The Squirrel's Maze 2D","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Krasimir Topchiyski/https://github.com/MetatransApps/Android_APK_2DMaze//releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Help the Squirrel. Different maze each time. Many levels.\n<p>If you are looking for a Maze or Squirrel puzzle game, this app is better to try.</p>\n<p>The goal is to walk in the maze and find a way to escape the Squirrel.</p>\n<p>The mazes are each time different and difficulty and size start from easy and small, and slowly step by step, go up to very hard and huge, so the game will sequentially challenge your brain more and more.</p>\n<p>In some levels, there are companies of other animals, which makes the game more dynamic and with an element of action game.</p>\n\n<p><br><b>Playing instructions:</b></p>\n<ol>\n<li>There are left and right joysticks, one for movement in the 4 directions and one for throwing the acorns again in the 4 directions.</li>\n<li>If you prefer to control with swapped joysticks, they could be switched from the menu.</li>\n<li>When you walk inside the maze, you could collect acorns. If you have acorns, you could throw them to the other animals in order to feed them.</li>\n<li>This way you keep your hearts, because if an unfeed animal touches you, it takes one of your hearts.</li>\n<li>The goal is to help the squirrel by collecting the key and finding the exit door.</li>\n<li>Meanwhile, if you collect 3 starts you go to the next level.</li>\n</ol>\n\n<p><br><b>Features:</b></p>\n<ol>\n<li>Increasing difficulties and sizes of labyrinths.</li>\n<li>Each time different mazes.</li>\n<li>Keeps track of your best result as High scores</li>\n<li>Supports different color palettes for different tastes.</li>\n</ol>\n\n<p><br><b>Permissions:</b></p>\n<p>The app uses ACCESS_NETWORK_STATE and INTERNET permsisions, because it shows home ads and they open the default browser on the device, going to one of our other apps' page on the store or on the website of Metatrans Apps.\nTo be more precise, if the other app is available on the store, from which the app is downloaded, then opens the app page of the other app on the same store. If still the app is not available on the store, then opens the app page on our website.\nThe app pages on our website have app demo video on YouTube, so a connection to youtube domain will also be listed in order to visualize the page in the browser.\nOur website is created by WordPress, so connections to other domains could be opened as well for technical purposes (e.g. downloading text fonts css).</p>\n\n<p><br>Your feedback and/or review is more than welcome.</p>\n\n","repo":{"author":"Krasimir Topchiyski","repo":"https://github.com/MetatransApps/Android_APK_2DMaze/"},"version":"e601d52711d633feab441285be8b83fffb2e263b32a9b8ba9bac5bc62636cd27","site":null,"source":"https://github.com/MetatransApps/Android_APK_2DMaze/","license_or_tos":"GPL-2.0-only","resources":null,"verified":false}