{"appId":"com.stoutner.privacybrowser.standard","appShortcutName":"Privacy Browser","appDisplayName":"Privacy Browser","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Soren Stoutner/https://gitweb.stoutner.com/?p=PrivacyBrowserAndroid.git;a=summary/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A web browser that respects your privacy.\nThe only way to prevent data from being abused is to prevent it from being collected in the first place. Privacy Browser has two primary goals.\n\n1. Minimize the data that is sent to the internet.\n\n2. Minimize the data that is stored on the device.\n\nMost browsers silently give websites massive amounts of information that allows them to track you and compromise your privacy. Websites and ad networks use technologies like JavaScript, cookies, DOM storage, user agents, and many other things to uniquely identify each user and track them between visits and across the web.\n\nIn contrast, privacy sensitive features are disabled by default in Privacy Browser. If one of these technologies is required for a website to function correctly, the user may choose to turn it on for just that visit. Or, they can use domain settings to automatically turn on certain features when entering a specific website and turn them off again when leaving.\n\nPrivacy Browser currently uses Android’s built-in WebView to render web pages. As such, it works best when the latest version of WebView is installed (see https://www.stoutner.com/privacy-browser/common-settings/webview/). In the 4.x series, Privacy Browser will switch to a forked version of Android’s WebView called Privacy WebView that will allow for advanced privacy features.\n\nFeatures:\n• Integrated EasyList ad blocking.\n• Tor Orbot proxy support.\n• SSL certificate pinning.\n• Import/export of settings and bookmarks.","repo":{"author":"Soren Stoutner","repo":"https://gitweb.stoutner.com/?p=PrivacyBrowserAndroid.git;a=summary"},"version":"f11d1e3c745ad9193f3d170fb88e07748fa63f36ec2c97f21f04de150f621592","site":null,"source":"https://gitweb.stoutner.com/?p=PrivacyBrowserAndroid.git;a=summary","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}