{"appId":"com.emanuelef.remote_capture","appShortcutName":"PCAPdroid","appDisplayName":"PCAPdroid","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Emanuele Faranda/https://github.com/emanuele-f/PCAPdroid/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"No-root network monitor and traffic dump tool for Android devices\n<i>PCAPdroid</i> is a privacy-friendly app which lets you track and analyze the connections made by the other apps in your device.\nIt also allows you to export a PCAP dump of the traffic, inspect HTTP, decrypt TLS traffic and much more.\n\nPCAPdroid simulates a VPN in order to capture the network traffic without root. It does not use a remote VPN server, instead data is processed locally on the device.\n\n<b>Features:</b>\n\n* Log and examine the connections made by user and system apps\n* Extract the SNI, DNS query, HTTP URL and the remote IP address\n* Inspect HTTP requests and replies thanks to the built-in decoders\n* Inspect the full connections payload as hexdump/text\n* Decrypt the HTTPS/TLS traffic and export the SSLKEYLOGFILE\n* Dump the traffic to a PCAP file, download it from a browser, or stream it to a remote receiver for real-time analysis (e.g. Wireshark)\n* Create rules to filter out the good traffic and easily spot anomalies\n* Identify the country and ASN of remote server via offline DB lookups\n* On rooted devices, capture the traffic while other VPN apps are running\n\nIf you plan to use PCAPdroid to perform packet analysis, please check out <a href='https://emanuele-f.github.io/PCAPdroid/quick_start#14-packet-analysis'>the specific section</a> of the manual.\n\nJoin the PCAPdroid international community on <a href=\"https://t.me/PCAPdroid\">Telegram</a> or on <a href=\"https://matrix.to/#/#pcapdroid:matrix.org\">Matrix</a>.\n","repo":{"author":"Emanuele Faranda","repo":"https://github.com/emanuele-f/PCAPdroid"},"version":"362b13c01e07ff319c02e1c377a6285ebdfb3cdd52117031b667b0cff32e9944","site":null,"source":"https://github.com/emanuele-f/PCAPdroid","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}