{"appId":"com.infomaniak.mail","appShortcutName":"Infomaniak Mail","appDisplayName":"Infomaniak Mail","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Infomaniak/https://github.com/Infomaniak/android-kMail/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The secure messaging service for your emails\nThe Infomaniak Mail app requires your email addresses to be hosted by Infomaniak.\nThis app allows you to manage your Infomaniak addresses in a completely secure environment.\n\nWith the Infomaniak Mail app, you can:\n\n- create a free @ik.me @etik.com or @ikmail.com address with 20 GB storage and no advertising which is managed in Switzerland in accordance with the GDPR.\n- send and receive emails via your Infomaniak email addresses.\n- define Infomaniak Mail as the default messaging service app.\n- search for a specific message or your unread emails, favourite emails or emails with attachments.\n- switch from one account to another to access all your email addresses managed by Infomaniak.\n- be notified immediately of the arrival of new emails (push).\n- organise your emails in personalised folders.\n- scan mails to move, archive and delete them quickly.\n- personalise your experience (dark/light theme, accent colour, display density, scanning actions in the inbox, etc.).\n- protect access to the Infomaniak Mail app (according to your device’s locking method).\n\nWith Infomaniak Mail, you keep full control of your data and communicate in a secure, sovereign and constantly developing ecosystem. The Infomaniak Mail app is developed by Infomaniak and its code is open source and available on our GitHub.\n\nInfomaniak has been a key cloud service provider in Europe and the foremost developer of productivity solutions in Switzerland for over 29 years. The company belongs exclusively to its employees and distinguishes itself by its commitment to privacy, the local economy and the environment.\n","repo":{"author":"Infomaniak","repo":"https://github.com/Infomaniak/android-kMail"},"version":"ed7b94b96868cce5329aa72b682caa29fefefd65813bd360b87b7bfd60a7bd76","site":null,"source":"https://github.com/Infomaniak/android-kMail","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}