{"appId":"com.odysee.floss","appShortcutName":"Odysee","appDisplayName":"Odysee","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/OdyseeTeam/odysee-android-floss/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Explore a whole universe of videos on Odysee from regular people just like you!\nEnjoy indie content creators across a variety of genres including pop culture, science, gaming, commentary, tech, and education.\n\nODYSEE FEATURES:\n\nDISCOVER CONTENT THAT'S ACTUALLY GOOD\n\n-Say goodbye to the boring corporate and celebrity creators that have flooded mainstream social media! Hello new person I find incredibly relatable!\n\n-Explore new content that's weird, crazy, intense, and surprisingly educational across a variety of categories like 'Cheese' & 'Universe'.\n\n-Follow and interact with new and interesting creators unheard of before.\n\nTHE COMMUNITY IS GREAT\n\n-Share your thoughts with everyone through comments, fire, and slime!\n\n-Follow and support the creators you enjoy.\n\n-Share the videos you love with the wider community.\n\nSTILL NEED CONVINCING THAT ODYSEE IS AWESOME?\n\nHear what some of the most inspirational voices of our time have to say:\n\n\"I love Odysee, that's why I came up with the idea for it shortly after I invented the internet.\" - Alle Gory\n\n\"What the hell is Odysee?\" - Ellen Musk\n\nOdysee is a fun, friendly, and safe video sharing platform that loves memes and spaghetti.\n\nCreators are encouraged to sign up through odysee.com in order to sync their existing channel's library. Currently the Odysee app does not support creator sign up.\n\nFor support, please visit the Odysee Help Hub: https://odysee.com/@OdyseeHelp","repo":{"author":"Unknown","repo":"https://github.com/OdyseeTeam/odysee-android-floss"},"version":"5ffa47df16659ef2e8900312cddfb4f927ed22cc149db2c305c12caf57912d04","site":null,"source":"https://github.com/OdyseeTeam/odysee-android-floss","license_or_tos":"MIT","resources":null,"verified":false}