{"appId":"com.drip","appShortcutName":"drip. menstrual cycle and fertility tracking","appDisplayName":"drip. menstrual cycle and fertility tracking","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Bloody Health collective/https://gitlab.com/bloodyhealth/drip/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Open-source, non-commercial and leaves your data on your phone.\nMenstrual cycle tracking can help you understand your body symptoms and gives you insights into your menstrual health. Use drip. for tracking your menstrual cycle and for fertility awareness. Unlike other menstrual cycle tracking apps, drip. is open-source and leaves your data on your phone, meaning you are in control.\n\nKey Features\n• Track your bleeding, fertility, sex, mood, pain, and more if you want\n• Graphs to analyse cycles and period duration as well as other symptoms\n• Get notified about your next period and required temperature measurements\n• Easily import, export and password protect your data\n\nWhat makes drip. special\n• Your data, your choice. Everything stays on your device\n• Not another cute, pink app. drip. is designed with gender inclusivity in mind\n• Your body is not a black box. drip. is transparent in its calculations and encourages you to think for yourself\n• Based on science. drip. detects your fertility using the sympto-thermal method\n• Track what you like. Your period only or fertility symptoms, and more\n• Open source. Contribute to the code, the documentation, translations and get involved with the community\n• Non-commercial. drip. doesn’t sell your data, no ads\n\nSPECIAL THANKS TO:\n• All the condriputors!\n• The Prototype Fund\n• The Feminist Tech Fellowship\n• The Mozilla Foundation\n• The Heart of Code","repo":{"author":"Bloody Health collective","repo":"https://gitlab.com/bloodyhealth/drip"},"version":"fc35cab9fb8ff0dd52ee90232a896a93709e2540b5f482aef36fcc1cbb66f8ef","site":null,"source":"https://gitlab.com/bloodyhealth/drip","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}