{"appId":"com.bartixxx.opflashcontrol","appShortcutName":"OnePlus Flash Control","appDisplayName":"OnePlus Flash Control","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Bartixxx/https://github.com/Bartixxx32/Opflashcontrol-app/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":31,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Control LED brightness on rooted OnePlus devices\nOnePlus Flash Control is a powerful and intuitive LED control application designed specifically for rooted OnePlus devices. This app allows users to customize their OnePlus device's LED functionality, offering control over the flashlight and other LED features. With features such as adjusting brightness levels and toggling LED states, OnePlus Flash Control provides an easy way to enhance the LED experience beyond the stock settings.\n\nKey Features:\n- Master Brightness Control: Adjust the overall LED brightness using a single slider.\n- Individual LED Control: Independently control the brightness of white, yellow LEDs for precise customization.\n- Safety Mechanism: The app includes a safety feature that ensures brightness levels never exceed safe thresholds, automatically adjusting brightness to safe levels if necessary.\n- \"Eye Destroyer\" Mode: A unique feature that flashes the LEDs at maximum brightness, emitting very intense light. This function is protected by a cooldown to prevent excessive use.\n- Quick Settings Tile: A quick settings tile to toggle the LED brightness with ease, including cycling through brightness levels and detecting double-tap gestures.\n- Root Access Required: Root access is required to interact with system-level files to control the LED settings, providing advanced control over the device's LEDs.\n- Support for Rooted OnePlus Devices: Specifically designed for OnePlus devices with dual-tone LED flash.\n- Secret Action: Unlock hidden features by tapping the app's title 5 times within 5 seconds, enabling a fun experimental mode.\nCompatibility:\n- Root Access: Required for controlling LED settings at the system level.\n- OnePlus Devices: Optimized for dual-tone LED flash OnePlus devices.\n- Whether you're looking to fine-tune your device's LED functionality or experiment with custom features, OnePlus Flash Control gives you full control over your phone's LEDs.","repo":{"author":"Bartixxx","repo":"https://github.com/Bartixxx32/Opflashcontrol-app"},"version":"5a5dc6529480594e76b5c1f7a25c729a27a8a70fb1064621c576885b7eae3348","site":null,"source":"https://github.com/Bartixxx32/Opflashcontrol-app","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}