{"appId":"com.omelan.cofi","appShortcutName":"Cofi - Brew Timer","appDisplayName":"Cofi - Brew Timer","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Leon Omelan/https://github.com/rozPierog/Cofi/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Open-source coffee timer. Easy-to-use interface. Perfect cup every time!\nAs a passionate coffee lover and amateur barista, I've always been on the hunt for the perfect cup of coffee. That's why I created the free and open-source coffee brew timer for Android. With this app, you can easily time your coffee brews and achieve the perfect flavor every time.\n\nI know how important it is to have complete control over your brew time, and that's exactly what this app provides. Whether you're using a French press, pour-over, or any other brewing method, our app makes it easy to keep track of your brew time and achieve the perfect flavor.\n\nFeatures:\n\n- Open-source and free to use\n- No artificial limits on what you can add to the app\n- Timer for your coffee brews\n- Customizable time settings for different brewing methods\n- Easy-to-use interface with a clean design and the latest material design\n- Picture-in-picture mode for multitasking\n- Wear OS app for easy timing on your smartwatch\n- Absolutely no user tracking or data collection\n\nI know how frustrating it can be to settle for a mediocre cup of coffee. That's why I want to help you brew like a pro and enjoy the perfect cup every time. Download Cofi now and start your journey to coffee perfection!\n","repo":{"author":"Leon Omelan","repo":"https://github.com/rozPierog/Cofi"},"version":"63d51af3d283176ba84c1eaa2a44a84292d33ccb0f6c13b5aacd429841b53d0d","site":null,"source":"https://github.com/rozPierog/Cofi","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}