{"appId":"com.michaeltroger.gruenerpass","appShortcutName":"PDF Wallet","appDisplayName":"PDF Wallet","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Michael Troger/https://github.com/michaeltroger/greenpass-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple PDF Wallet for your most important PDFs\nAn app that is fully open source. This app is a simple to use PDF Wallet. That means it takes over the task to store and display your most important PDF certificates. It includes a convenient fullscreen barcode rendering, if a barcode is present in the PDF.\n\n<b>Brief Instruction</b>\n- Open \"PDF Wallet\"\n- Import PDF\n- Done\n\n<b>Alternative Brief Instruction</b>\n- Go to your file browser, email, web browser or PDF reader app\n- Open/Share the PDF with \"PDF Wallet\"\n- Done\n\n<b>Description</b>\nVery simple app, that does nothing more than conveniently storing and displaying PDF certificates. You can use it for public transport tickets, bills, contracts, certificates and any other PDF file.\nThe PDF file has to be imported into the app. Following the barcode is displayed in fullscreen, as well as the PDF document itself. That's already it.\n\nCurrently supported barcode formats are:\n- Matrix (2D) codes: QR, Aztec, DataMatrix and PDF417\n- Linear (1D) codes: UPC-A, UPC-E, EAN-8, EAN-13, CODE-39, CODE-93, CODE-128, ITF and Codabar\n\n<b>More Features</b>\n- Can detect and extract barcodes in PDFs\n- (Optional) fingerprint authentication\n- PDFs can be individually sorted and named\n- PDFs can be opened\n- PDFs can be shared from other apps\n- PDFs can be shared with other apps (indirectly allows printing)\n- Dark Mode support\n- Supports also password protected PDFs\n- Two different layouts to choose from\n\n<b>Why does the generated barcode look differently than the one in the PDF?</b>\nThe algorithm to display is different. For reading devices the code is identical.\n\n<b>Privacy</b>\nThis app values your privacy by being fully open source and working offline. No ads, no tracking.\n\n<b>Issues</b>\nThis is a free time project of a single developer. Therefore please understand that replies can take a little while.\n","repo":{"author":"Michael Troger","repo":"https://github.com/michaeltroger/greenpass-android"},"version":"a2da5f8560ccf4235befdd7185e1d2bc6dc7b38137c0c33f7eebf1591f561f5a","site":null,"source":"https://github.com/michaeltroger/greenpass-android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}