{"appId":"com.pavelsof.wormhole","appShortcutName":"Wormhole","appDisplayName":"Wormhole","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/pavelsof/https://github.com/pavelsof/mobile-wormhole/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Armv7"]}},"displayImages":[],"description":"Send and receive files using the Magic Wormhole protocol\nThis is an Android client for the <a href=\"https://github.com/warner/magic-wormhole\">Magic Wormhole</a> protocol. You can use it to exchange files between your phone and another Magic Wormhole client, including the original command-line client.\n\nHow to send files\n\n* From the main screen, tap the \"send\" button. Then use the \"choose file\" button to pick the file that you want to send.\n* Alternatively, open the file that you want to send and tap the share icon: Wormhole should be listed among the apps you can use to share the file.\n* Either way, the app will have generated a code, a random number followed by two random words. The person to whom you want to send the file will have to enter this code in their Magic Wormhole client. The code is also copied to the clipboard for convenience.\n* Tap the \"send\" button. When the user at the other end of the wormhole enters the code and confirms, the file will start transferring.\n* The \"send\" button will change to \"done\" when the transfer is complete.\n\nHow to receive files\n\n* From the main screen, tap the \"receive\" button.\n* Enter the code that the sender has provided you with and tap the \"connect\" button.\n* You will see the incoming file's name and size. If all looks good, tap the \"receive\" button to start the file transfer.\n* When the file is downloaded from the wormhole, the \"receive\" button will change to an \"open dir\" button.\n\nThe app is still in beta and there is still a lot to be desired. However, the basic functionality of sending and receiving files seems to be there. I find it useful, so someone else might as well.\n\nThe code is <a href=\"https://github.com/pavelsof/mobile-wormhole\">open sourced</a> under GPLv3. Pull requests are welcome.\n","repo":{"author":"pavelsof","repo":"https://github.com/pavelsof/mobile-wormhole"},"version":"e262966cd467a1548f55d663209e493a708e740cee03ab2afdb617e9622a3c87","site":null,"source":"https://github.com/pavelsof/mobile-wormhole","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}