{"appId":"com.picross.nonocross","appShortcutName":"Nonocross","appDisplayName":"Nonocross","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Jared Forrest/https://github.com/jaredforrest/nonocross/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Nonocross is a simple number puzzle game\nWhat's Nonocross\n\nNonocross is a simple number puzzle game based around grids. The game is known by many names Nonograms, Picross, Griddlers, Pic-a-Pix, Hanjie and various others.\n\n- Modes\nThere are two game modes. You can either practice on a pre-made grid, or you can play a randomly generated grid with custom parameters.\n\n- How to play\nThe game is relatively simple, the number in each row/column corresponds to the number of filled cells in that row/column. So '3 5' at the beginning of a column means there is a block of 3 cell and a block of 5 cell in that column which are not touching. Once you have the grid in front of you it will all make sense\n\n- Notes\nThe camera permission is used to share puzzles using QR codes\nNonograms are also known by many other names, including Paint by Numbers, Griddlers, Pic-a-Pix, Picross, Picma, PrismaPixels, Pixel Puzzles, Crucipixel, Edel, FigurePic, Hanjie, HeroGlyphix, Illust-Logic, Japanese Crosswords, Japanese Puzzles, Kare Karala!, Logic Art, Logic Square, Logicolor, Logik-Puzzles, Logimage, Oekaki Logic, Oekaki-Mate, Paint Logic, Picture Logic, Tsunamii, Paint by Sudoku and Binary Coloring Books\n","repo":{"author":"Jared Forrest","repo":"https://github.com/jaredforrest/nonocross"},"version":"04c2a48e0e69f1071d91e4659b0cb05c0d57c2158e59a645015bdc63e4012af5","site":null,"source":"https://github.com/jaredforrest/nonocross","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}