{"appId":"com.chancehorizon.just24hoursplus","appShortcutName":"Just 24 Hours","appDisplayName":"Just 24 Hours","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://gitlab.com/pardomi/just-24-hours/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":" A free and open source app that shows a large digital clock\nWhen all you need is to know what time it is, only the actual time matters.\n\nThere are many wonderful clock applications available for Android devices.\nMany have have lots of great features. Choice in applications is a good\nthing.\n\nWhen one wishes to choose a simple clock application that just displays the\ntime of day in as large numbers as can fit on the screen's device, Just 24\nHours is here!\n\n'''Features:'''\n\nJust 24 Hours will display the time of day in 24 hour format in a big\nnumbers as will fit on the screen. For those that were corrective lenses,\nit can be challenging to read small numbers when just waking up. Big\nnumbers are required. No matter what size screen your Android device has,\nJust 24 Hours will use as big a text size that will fit on the screen.\n\nThat is all. No alarm settings. No typeface settings. No colour settings.\n\nJust a big clock to see what time of day it is.\n\nOf course, this is not what everyone wants in a clock application. This is\nokay. There are dozens of clock applications available for Android. Most\n(maybe all!) are great applications. We are certain that there will be one\nthat will satisfy one's desired features. For those that just want the\ntime, Just 24 Hours is here!\n","repo":{"author":"Unknown","repo":"https://gitlab.com/pardomi/just-24-hours"},"version":"430d72015dcc9c4137d2fdcda33df0ebefb8fc44c0452f3bd2b9081aaead9a6a","site":null,"source":"https://gitlab.com/pardomi/just-24-hours","license_or_tos":"MIT","resources":null,"verified":false}