{"appId":"com.lightplanx.xddk","appShortcutName":"LightPlan - Reminder & Planner","appDisplayName":"LightPlan - Reminder & Planner","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/XDDK/https://github.com/XDDK/LightPlan/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Remind yourself about important tasks. Plan your entire year with a countdown!\nLight Planner is a FOSS, simple, and intuitive app that will help you with planning events, tasks, or achievements you want to reach!\n\n==============\nHow does it work?\n==============\n• Add your tasks in a chosen year quarter\n• Write up a title and a description and pick a deadline for it\n\n\tThat’s it! Upon entering the task area, you will be shown the time you have left to complete it and (optionally) the subtasks you have created in it.\n\n==============\nWho is it made for?\n==============\n\tAnyone! No matter the age or height, you can use the app to plan ahead and keep track of the time you have left to complete it at any time.\n\n==============\nHow is it different from other apps?\n==============\n\tThis app was designed to be simple and intuitive, while still looking slick and unintrusive. We also don’t collect any data from users (everything is stored on your device), which means you don’t have to create/link an account and you won’t have to deal with any pesky ads!\nAdditionally, the project is open-source, so if you feel like changing or adding features, you can do it!\n(link to the project repository: https://github.com/XDDK/LightPlan).\n\nI hope you'll find this app useful!","repo":{"author":"XDDK","repo":"https://github.com/XDDK/LightPlan"},"version":"10fe1250539725bf493afd4c4c04db306b5dc4048f249be0a97304dbcff6ee21","site":null,"source":"https://github.com/XDDK/LightPlan","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}