{"appId":"com.philkes.notallyx","appShortcutName":"NotallyX - Quick Notes/Tasks","appDisplayName":"NotallyX - Quick Notes/Tasks","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Phil/https://github.com/PhilKes/NotallyX/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A simple and minimalistic open source notes app\nNotallyX is a minimalistic note taking app with a simple design and powerful features.\n\n<b>Organization</b>\n\n• Create rich text notes with support for bold, italics, mono space and more\n• Create task lists and order them with subtasks\n• Set reminders with notifications for important notes\n• Complement your notes with any type of file such as pictures, PDFs, etc.\n• Sort notes by title, last modified date, creation date\n• Display the notes either in a List or Grid\n• Color, pin and label your notes for quick organisation\n• Add clickable links to notes with support for phone numbers, email addresses and web urls\n• Actions to quickly remove checked tasks\n• Undo/Redo actions\n• Extensive preferences to adjust views to your liking\n• Quickly share notes by text\n• Lock your notes via Biometric/PIN\n• Configurable auto-backups\n• Create audio notes\n• Adaptive android app icon\n• Support for Lollipop devices and up\n\n<b>Convenience</b>\n\n• Dark mode\n• Completely free (+ no Ads!)\n• Adjustable text size\n• Auto save and auto-backups (optionally password-protected)\n• Add notes and lists to your home screen with widgets\n• Import from other Notes apps such as Evernote, Google Keep or plain text files\n\n<b>Privacy</b>\n\nThere are no ads, trackers or analytics of any kind. All your notes are stored completely on and never leave your device.\n\n<b>Optional Permissions</b>\n\n• Show Notifications, Run Foreground Service: To display a notification if a backup fails or if reminders are triggered\n\n• Schedule exact Alarms: To schedule reminder notifications at exact date-times\n\n• Prevent Phone from Sleeping, Run at Startup: Used by the auto backup feature to ensure backups keep happening even if your phone is restarted\n\n• Record audio: when recording an audio note\n\n• Use Biometrics: if Biometric/PIN app lock setting is enabled, to unlock the app\n\n<b>Note</b>\n\nDue to a bug on Xiaomi's part, some MiUI devices might not be able to access the text formatting options.\n\nhttps://github.com/PhilKes/NotallyX\n","repo":{"author":"Phil","repo":"https://github.com/PhilKes/NotallyX"},"version":"7a112207f913a72bb7e72d562b3e40f5bc4003934fe5206645c7569fe8180469","site":null,"source":"https://github.com/PhilKes/NotallyX","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}