{"appId":"com.rk.xededitor","appShortcutName":"Xed-Editor","appDisplayName":"Xed-Editor","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/Xed-Editor/Xed-Editor/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Advanced Text Editor for Power Users\nXed Editor, also known as Karbon, is a powerful text editor designed for Android devices, catering to developers and programmers. It offers a range of features to enhance productivity and streamline coding.\n\nKey Features:\n- Advanced Editing Capabilities: Syntax highlighting for multiple programming languages, auto-indentation, search and batch replacement, and undo-redo support.\n- File Management: Open and edit multiple files using tabs, integrated file browser, and options to create, rename, copy, and delete files/folders.\n- Customization: AMOLED theme for night use, multiple theme options, and customizable keybindings.\n- Developer Tools: Built-in terminal with Alpine Linux support, ability to run Python and Node.js, and interoperability with Termux.\n- Additional Features: Word wrap, print text documents, Markdown support with preview functionality, and a plugin system.\n\nCommunity and Development:\nThe project is open-source and encourages community contributions. Users can report issues or suggest features through the GitHub repository. Xed Editor is continuously updated to improve functionality and user experience, making it a strong alternative to other Android text editors.\n","repo":{"author":"Unknown","repo":"https://github.com/Xed-Editor/Xed-Editor"},"version":"5dbd69430725ee6f2483ff13bb7bedd75a1d31136cb2df0a7dbe6c1d639f4dcd","site":null,"source":"https://github.com/Xed-Editor/Xed-Editor","license_or_tos":"MIT","resources":null,"verified":false}