{"appId":"com.urbandroid.dontkillmyapp","appShortcutName":"DontKillMyApp ✌️ Make apps work","appDisplayName":"DontKillMyApp ✌️ Make apps work","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/urbandroid-team/dontkillmy-app/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The official DontKillMyApp app is here - make apps finally work properly even if\nThe official DontKillMyApp app is here - make apps finally work properly even if you do not own a Pixel.\n\nHelps you set up your phone background tasks so that your apps can finally work for YOU even when not looking at the screen right now.\n\nSee how is your phone doing and test different settings with DontKillMyApp benchmark.\n\nFeatures:\n• DKMA benchmark: Measure how aggressively is your phone killing background apps\n• Guides: Get actionable steps to overcome most background process restrictions\n• Make a change:️Help smartphones stay smart by sharing your benchmark report to dontkillmyapp.com\n\nDontKillMyApp is a benchmark tool to see how well does your phone support background processing. You can measure before setting up your phone, then go through the setup guides and benchmark again to see how much has your phone been slacking in the background.\n\nYou can share your report through the app to the maintainers of the dontkillmyapp.com website who compile it and base the overall negative score on it.\n\nHow does the benchmark work? (Technical!)\n\nThe app starts a foreground service with a wake lock and schedules repetitive task on the main thread, a custom thread executor and schedules regular alarms (AlarmManager.setExactAndAllowWhileIdle). Then it calculates executed vs. expected. That's it!\n\nFor more details check the code. The app is open source available it https://github.com/urbandroid-team/dontkillmy-app\n\nSpecial thanks to Doki (github.com/doubledotlabs/doki).","repo":{"author":"Unknown","repo":"https://github.com/urbandroid-team/dontkillmy-app"},"version":"325da54c1d8a360bcec0777cd55e4654896c8d583669f312641e36fbaf2e0672","site":null,"source":"https://github.com/urbandroid-team/dontkillmy-app","license_or_tos":"Apache-2.0","resources":null,"verified":false}