{"appId":"com.simplemobiletools.applauncher","appShortcutName":"Simple App Launcher","appDisplayName":"Simple App Launcher","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Tibor Kaputa/https://github.com/SimpleMobileTools/Simple-App-Launcher/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A customizable holder for your favorite apps, reorder icons as you wish.\nA nice wrapper for your favorite app icons for quick launching. You can easily add any app launcher, so you won't ever again have to swipe through useless apps to find the one you need. You can also rename the launchers as you wish.\n\nYou can customize the colors in different styles. This launcher also comes with dark theme to give you a more smooth feel while using your device.\n\nThere is an option to close the app itself at launching a different one for easy navigation.\n\nWe can not uninstall unwanted system apps, you can just remove their icons and ignore them.\n\nIt comes with material design and dark theme by default, provides great user experience for easy usage. The lack of internet access gives you more privacy, security and stability than other apps. With this launcher, you don't have to connect your device with any network. Simply install it and use it.\n\nContains no ads or unnecessary permissions. It is fully opensource, provides customizable colors and dark theme to make your home screen look more stunning. With this launcher, you can enjoy different new and improved icons and designs that are not available in any other app launcher. \n\nFeatures:\n\n- Dark theme to give you a more smoother feel of your device.\n- Easy navigation through the launcher so you can choose the best one for yourself.\n- Organize your apps to sections.\n- Exquisite color themes.\n- No annoying advertisements.\n- Enjoy!\n\nCheck out the full suite of Simple Tools here:\nhttps://www.simplemobiletools.com\n\nFacebook:\nhttps://www.facebook.com/simplemobiletools\n\nReddit:\nhttps://www.reddit.com/r/SimpleMobileTools\n\nTelegram:\nhttps://t.me/SimpleMobileTools","repo":{"author":"Tibor Kaputa","repo":"https://github.com/SimpleMobileTools/Simple-App-Launcher"},"version":"6a470ed5e39fb20add8a9c6d03f5a792a89e3c28b2bf05dc85a88ea4e5053c46","site":null,"source":"https://github.com/SimpleMobileTools/Simple-App-Launcher","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}