{"appId":"com.wmstein.tourcount","appShortcutName":"TourCount","appDisplayName":"TourCount","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Wilhelm Stein/https://github.com/wistein/TourCount/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A butterfly monitoring app for species-specific registering of butterflies in Eu\nTourCount supports species-specific and individually GPS-localized registering of butterflies. \n\nNew in Version  3.6.0:\n- Option to preselect species names by initial letters for editing them in the counting list\n- App gets completely removed from memory when finished\n- Code improvements\n- Bug fixes\n- Docs updated\n\nFeatures:\n- Data recording is organized for a regional tour with its expected butterfly species.\n- Databases can be individually created and adapted within the app regarding meta data and expected butterfly species.\n- The app has an internal pool of many European species and comes with a prepared basic database with the most common species in Europe as a starting point for direct use.\n- Separate counters for ♂-♀-indeterminate, ♂, ♀, pupa, larva or egg.\n- You may use an individual species list per region.\n- Results are prepared for easy readout to transfer them to the science4you entry mask for butterfly registration.\n- Results may be exported in SQLite- or CSV-format (for transfer to a PC for your own processing, e.g. in a spreadsheet.)\n- Help contains a detailed userguide.\n\nFunctions:\n- Editor for metadata in preparation for an inspection\n- Counter page with scroll-down list for species selection\n- Editor for individual species data of a count (e.g. status, remark or bulk count entry).\n- The app automatically inserts date, time, coordinates and height as well as location data by reverse OSM-geocoding provided that GPS and internet are accessible.\n- The app provides functions to add, delete or edit the species for the current species list.\n- The results page shows metadata, notes, totals and counting results per species.\n\nPrerequisites:\nThe app demands for \n- storage access permit for importing and exporting counting data,\n- GPS (Location) permit for coordinates and location info per count, \n- internet access for OpenStreetMap reverse geocoding requests, \n- the permit to set the screen brightness,\n- the permit to prevent the sleep mode.\n\nThe smartphone screen should have a minimum resolution of 1920 x 1024 pixels. \nThe app is usable with Android version 7.1 (Nougat) or newer.\n\nDocumentation is provided under  \nhttps://github.com/wistein/TourCount/tree/master/docs.\n\nTourCount is one of two apps for European butterfly monitoring. \nThe 2nd app, TransektCount serves transect counters on their inspection walks. It supports species-specific counting of butterflies per transect section according to the European Butterfly Monitoring Scheme method.\n\nBoth apps use the coding scheme of Karsholt/Razowski for European butterflies and thus contain only European butterfly pictures.\n","repo":{"author":"Wilhelm Stein","repo":"https://github.com/wistein/TourCount"},"version":"3d1da77203f62c863a5099311e034e1a79641cac4efc07504d200afe8cc5c52f","site":null,"source":"https://github.com/wistein/TourCount","license_or_tos":"Apache-2.0","resources":null,"verified":false}