{"appId":"com.sapuseven.untis","appShortcutName":"BetterUntis","appDisplayName":"BetterUntis","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/SapuSeven/https://github.com/SapuSeven/BetterUntis/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"An alternative mobile client for the Untis timetable system.\nBetterUntis is an open-source mobile client for the Untis timetable system\nwhich allows you to view your timetable on your smartphone.\n\nThe app allows customization of almost any aspect of your timetable,\nincluding multiple themes and dark mode.\n\nEasily add multiple profiles with separate settings and timetables.\n\nProtect your privacy with support for proxy servers.\n\nUse Notifications to show information about the next lesson.\n\nOther features include a room finder to search for free rooms in your school\nand an info center to view upcoming events, your absences and more.\n\nEnjoy a fast and smooth experience with BetterUntis.\n\n\nUntis is proprietary timetable software. More information about Untis can be\nfound at https://untis.at.\nTo use Untis, your school must provide it.\nYour school must also give you an account which you can use to access\nyour current timetable if no anonymous access is available.\n\nWhy use this app when there is an official one?\nThe official app is proprietary and includes tracking software and in-app purchases.\nBetterUntis is free and open source, feature-rich and respects your privacy.\n\nWebUntis is a proprietary network.\n","repo":{"author":"SapuSeven","repo":"https://github.com/SapuSeven/BetterUntis"},"version":"64be0d6f36eb8dce34be5e07c72bc5cdc5ad45de905144e1aae0cae2e2ff2586","site":null,"source":"https://github.com/SapuSeven/BetterUntis","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}