{"appId":"com.google.zxing.client.android","appShortcutName":"Barcode Scanner","appDisplayName":"Barcode Scanner","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/ZXing Team/https://github.com/zxing/zxing/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Scan barcodes on products, or barcodes containing URLs, contact info, and so on\n<b>NOTE:</b> This app is in maintenance mode only. It will probably not get any updates.\n\nRead the information stored in barcodes or create QR-codes for sharing addresses, contacts or text between devices.\n\nBook, product and web searches go to a Google server (depending on the choice of origin country), though a custom search button can be created in the settings e.g. duckduckgo.com/?q=%s or wikibooks.org/w/index.php?search=%s.\n\nSupports following barcode types:\n\n* UPC-A and UPC-E\n* EAN-8 and EAN-13\n* Code 39; 93; 128\n* ITF\n* Codabar\n* RSS-14 (all variants)\n* QR Code\n* Data Matrix\n* Aztec ('beta' quality)\n* PDF 417 ('alpha' quality)\n\nSee the website for troubleshooting and explanations of the permissions. The app allows you to share contacts, apps, and bookmarks in a QR Code. This is why contacts permissions are needed. See \"Visit Developer Website\" below ( https://github.com/zxing/zxing/wiki/Frequently-Asked-Questions ).\n\nIf your device is not scanning, first try workarounds for device bugs in Settings. Enable all of them, and then try disabling one at a time to determine which is necessary. If this does not help, try clearing the device cache and settings from Android settings.\n\nIf these still do not work and you believe there is an app problem, send a message to the author with the following information. Messages without this information can't be acted on, so are ignored.\n\n- Device type\n- A basic description of what does not work: crashes? does not scan? looks strange?\n- Acknowledgement that you tried the steps above first\n- A device log capture from when it starts\n","repo":{"author":"ZXing Team","repo":"https://github.com/zxing/zxing"},"version":"2ed4c2661ed0e2e56b2980d59291dacd58040d219cb7e83b3f6db1102d2ed483","site":null,"source":"https://github.com/zxing/zxing","license_or_tos":"Apache-2.0","resources":null,"verified":false}