{"appId":"com.artifex.mupdf.mini.app","appShortcutName":"MuPDF mini","appDisplayName":"MuPDF mini","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Artifex Software LLC/https://cgit.ghostscript.com/cgi-bin/cgit.cgi/mupdf-android-viewer-mini.git/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86"]}},"displayImages":[],"description":"Minimalist viewer for PDF, XPS, CBZ, unprotected EPUB, and FB2 documents\n<i>MuPDF Mini Viewer</i> is a minimalist Android app that uses the MuPDF library to\nview PDF, XPS, CBZ, unprotected EPUB, and FB2 documents.\n\nThis is a minimalist version of the MuPDF app, which focuses on reading only. It\ndoes not support editing annotations or filling out forms.\n\nThe app will start with a file picker showing the contents of the external\nstorage directory. Only files that it can open will be listed.\n\nEach document you open will start its own activity, so you can view many\ndocuments at once. Use the Overview system button to switch between the file\npicker and any open documents and other activities you have running.\n\nTapping on the left and right side of the screen will flip to the previous and\nnext pages. Tapping in the middle will bring up or hide the tool bars. A long\ntap will toggle highlighting of links. When the links are highlighted they are\nalso active and tappable.\n\nYou can pinch to zoom in. When zoomed in, tapping will scroll to advance the\nnext screenful of content.\n\nIn the toolbar there is a button to show the table of contents, if the document\nhas one. In EPUB and FB2 documents, there is also a menu item to pick the font\nsize. The scrubber at the bottom allows you to quickly jump to a given page in\nthe document.","repo":{"author":"Artifex Software LLC","repo":"https://cgit.ghostscript.com/cgi-bin/cgit.cgi/mupdf-android-viewer-mini.git"},"version":"ba0de26a5620baa4e250f305e22dbb8dea4713e463d347e3e94d094ed10f90df","site":null,"source":"https://cgit.ghostscript.com/cgi-bin/cgit.cgi/mupdf-android-viewer-mini.git","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}