{"appId":"com.greenaddress.greenbits_android_wallet","appShortcutName":"Green: Bitcoin Wallet","appDisplayName":"Green: Bitcoin Wallet","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/GreenAddress IT Ltd/https://github.com/blockstream/green_android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7"]}},"displayImages":[],"description":"Blockstream Green Bitcoin wallet\nBlockstream Green is a simple and secure Bitcoin wallet that makes it easy to get started sending and receiving Bitcoin and Liquid-based assets such as Liquid Bitcoin (L-BTC) and Tether’s USDt.\n\nBuilt by Blockstream, one of the most security-focused teams in the Bitcoin industry, Blockstream Green is supported across multiple platforms and is designed for Bitcoin beginners and power users alike.\n\nEASY SETUP\nNo registration or personal details are required to get started, just write down your recovery phrase and start making Bitcoin transactions right away.\n\nFASTER & CHEAPER BITCOIN TRANSACTIONS\nSmart fee estimation ensures your Bitcoin payments arrive on time without being charged excessive fees.\n\nMULTILINGUAL\nWe speak your language. Green includes support for Brazilian Portuguese, Chinese (Simplified), Dutch, English, French, German, Hebrew, Italian, Japanese, Korean, Russian, Spanish, Ukrainian, Vietnamese. And more to come!\n\nBITCOIN LAYER-2 SUPPORT\nSend and receive Liquid Bitcoin L-BTC, Tether’s USDt, and any other Liquid-based assets with a Liquid account.\n\nTWO-FACTOR MULTISIG SECURITY\nUnique dual-key security with one key protected by two-factor authentication. Multiple authentication options are available including, Google Authenticator, SMS, and email.\n\nBitcoin power users will feel right at home with a wide range of advanced features and industry-firsts:\n\nFEE CONTROL\nFully customizable transaction fees with replace-by-fee support so that you can start low and adjust the fee if necessary. Great for pushing through urgent transactions without overpaying.\n\nHARDWARE WALLET SUPPORT\nIntegration with Blockstream Jade, Ledger Nano S and X, Trezor One and T (see our help desk for latest compatibility across the various supported platforms).\n\nTWO-FACTOR THRESHOLDS\nRequire two-factor authentication for large payments only, by setting a two-factor threshold. Total payments up to the threshold can be completed without 2FA.\n\nWATCH-ONLY WALLETS\nKeep an eye on your Bitcoin balances while on the go and receive payments from others without needing to grant payment permissions to your device.\n\nTESTNET SUPPORT\nEasily make test transactions on Bitcoin testnet.\n\nPRIVACY\nNo documents, personal information, or KYC required. An email address is needed for wallet recovery purposes only. Connect via Tor at the tap of a button, no other apps needed.\n\nCONNECT TO YOUR OWN NODE\nVerify transactions on your own full node with SPV support.","repo":{"author":"GreenAddress IT Ltd","repo":"https://github.com/blockstream/green_android"},"version":"cf14fbda1027bdb9fe8c5b3155f527d56c0ca2bae8729bb23414fba0435799d7","site":null,"source":"https://github.com/blockstream/green_android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}