{"appId":"com.superproductivity.superproductivity","appShortcutName":"Super Productivity","appDisplayName":"Super Productivity","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Johannes Millan/https://github.com/johannesjo/super-productivity//releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Free to do list & time tracker\nOrganize your daily tasks at one place while making time tracking a lot less annoying. Super Productivity is a ToDo List / Time Tracker / Personal Jira Task Manager for multiple platforms.\n\n<h3>Features</h3>\n\n<b>Plan, track & summarize</b>. Create time sheets and work summaries in a breeze to easily export them to your companies time tracking system.\n\nIntegrate with <b>Jira</b>, <b>Github</b> and <b>Gitlab</b>. Auto import tasks assigned to you, plan the details locally, automatically create worklogs and get notified right away, when somfething changes.\n\nOrganize your project's data. Create <b>notes</b>, attach <b>files</b> or create <b>bookmarks</b> for links, files and even commands and have it all out of the way, once you're ready for the weekend.\n\nHelps you to <b>establish healthy habits</b>. A break timer reminds to you, when it's time to step away. You also can collect personal metrics for yourself to see, which of your work routines need adjustments.\n\nStuck and procrastinating? No problem! Super Productivity's <b>anti procrastination</b> feature helps you to reconsider your options and a <b>pomodoro timer</b> is also always at hand.\n\nSuper Productivity <b>does NOT actively collect any data</b> and there are no user accounts or registration. It's <b>free</b> and <b>open-source</b> and always will be. <b>NOTE:</b> There will however be data loaded from app.super-productivity.com on app start and if you use one of the third party providers, you will have to comply with their private policy.\n\n<a href=\"https://super-productivity.com/private-policy/\">Private Policy</a>\n","repo":{"author":"Johannes Millan","repo":"https://github.com/johannesjo/super-productivity/"},"version":"a2192bad44f8b0a56bf80610b7b3c8b1da0007b58de904d9174b2ceb4985f33d","site":null,"source":"https://github.com/johannesjo/super-productivity/","license_or_tos":"MIT","resources":null,"verified":false}