{"appId":"com.evilinsult","appShortcutName":"Evil Insult Generator","appDisplayName":"Evil Insult Generator","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Evil Insult Generator & Contributors/https://github.com/EvilInsultGenerator/android-app/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"This is the greatest insults app you can get!\nWhy should you download the Evil Insult Generator, as opposed to another insult app?\n\n<b>Simplicity</b>\nThe interface is user-friendly, and the insults are all of high quality. The app was developed to provide you with a pleasurable experience.\nOn the app's main screen, you'll have the ability to generate and browse various evil insults. Using the app couldn't be easier, and it only takes a second to generate new insults. You can browse through them with a simple tap of your screen.\n\n<b>Free & Open Source</b>\nThis app is completely free to use and will stay that way forever. The source code is available on GitHub. You do not have to worry about special memberships, annual subscriptions, or hidden costs to generate results and share them with others.\n\n<b>Sharing</b>\nWe endeavored to simplify the process of using this app. You will be able to share insults produced by the Evil Insult Generator at no charge. Your insults can be shared with friends on various apps. \n\n<b>Updated Regularly</b>\nThe development team that created this app are always adding new insults to it. Each insult is easy to share, and others can use them, if desired. \nBut we need your support. Please send us your insults and we will review it. If we like it, the insult will be the newest addition to the app. \n\n<b>A Huge Collection of Insults</b>\nThis app does not have any shortage of insults that you can use. Many of them have a uniqueness that can’t be found anywhere else.\nDon't delay – download the evil insults app and come up with creative lines that you can use on just about anybody!\nWe endeavor to optimize user experiences for everyone. Feedback is something we welcome. If you have a recommendation or suggestion, we would like to hear them. Don't hesitate to get in touch with us at marvin@evilinsult.com. In doing so, we will be able to optimize your experience and keep the app updated with cutting-edge insults.\n\n<b>ℹ️ Note ℹ️</b>\n- The source can be found here: https://github.com/EvilInsultGenerator/android-app/\n- Your assistance with app translation is very much appreciated: https://crowdin.com/project/evil-insult-generator-android/\n- Feel very welcome to send me your favorite insults so that I can add them\n\n<b>⚠️ Warning ⚠️</b>\nMany insults that are generated by the app will offend some people, and as such, you should be careful with whom you use these insults on. This app is for mature users only.\n","repo":{"author":"Evil Insult Generator & Contributors","repo":"https://github.com/EvilInsultGenerator/android-app"},"version":"669a2a2d30d58a94d476834455886908b47d5d0ffc996922358d1242f4a1a631","site":null,"source":"https://github.com/EvilInsultGenerator/android-app","license_or_tos":"Unlicense","resources":null,"verified":false}