{"appId":"com.anthonyla.paperize","appShortcutName":"Paperize - A Wallpaper Changer","appDisplayName":"Paperize - A Wallpaper Changer","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/Anthonyy232/Paperize/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Paperize is an efficient wallpaper changer application with a clean design\nPaperize - A Wallpaper Changer is a dynamic and versatile app that breathes life into your device’s aesthetics. It’s not just a wallpaper changer; it’s a tool that allows you to personalize your device to reflect your style and mood.\n\nDynamic Wallpaper Changer: With Paperize, you can set your wallpaper to change at specific time intervals. This means your device’s look will always be fresh and exciting.\n\nAdvanced Image Manipulation: Paperize isn’t just about changing wallpapers; it’s about enhancing them. You can darken or blur your wallpapers to suit your visual preferences or to make your icons stand out.\n\nHome and Lock Screen Customization: With Paperize, you have the freedom to set your home screen and lock screen wallpapers together or separately, and at the same time or not. This gives you the ultimate control over your device’s look and feel.\n\nSupports Various Image Types: Paperize can handle a wide range of image types, offering you flexibility in your wallpaper choices. Whether it’s a JPEG, PNG, AVIF or a WEBP, Paperize has got you covered.\n\nFolder Support: Organize your wallpapers into folders for auto-updating. This feature allows you to categorize your wallpapers and have them change automatically, keeping your device’s look organized and cohesive.\n\nOn-Device Storage: All your wallpapers and settings are stored on your device, ensuring quick loading times and reducing data usage. Your favorite wallpapers are always just a tap away.\n\nExperience the joy of a personalized device with Paperize - A Wallpaper Changer. Your device, your style.\n\nPrivacy policy: https://anthonyy232.github.io/Paperize/","repo":{"author":"Unknown","repo":"https://github.com/Anthonyy232/Paperize"},"version":"2b2ac21f6c12b516a2bd244fddd47116fb18ea4bd8b507724bd5dedef85f67c8","site":null,"source":"https://github.com/Anthonyy232/Paperize","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}