{"appId":"com.fmsys.snapdrop","appShortcutName":"Snapdrop & PairDrop for Android","appDisplayName":"Snapdrop & PairDrop for Android","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/fm-sys/https://github.com/fm-sys/snapdrop-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Transfer files seamlessly between all your devices - Snapdrop\nSnapdrop & PairDrop for Android is an Android™ client for the free and open source local file sharing solutions https://snapdrop.net/ and https://pairdrop.net/.\n\nDo you also sometimes have the problem that you just need to quickly transfer a file from your phone to the PC?\n\nUSB? - Old fashioned!\nBluetooth? - Much too cumbersome and slow!\nE-mail? - Please not another email I write to myself!\n\nSnapdrop!\n\nSnapdrop (as well as the enhanced version \"PairDrop\") is a local file sharing solution which completely works in your browser. A bit like Apple's Airdrop, but not only for Apple devices. Windows, Linux, Android, IPhone, Mac - no problem at all!\n\nHowever, even if it theoretically would fully work in your browser, you will love this app if you want to use Snapdrop or PairDrop more often in your daily life. Thanks to perfect integration into the Android operating system, files are sent even faster. Directly from within other apps you can select Snapdrop to share with.\n\nThanks to its radical simplicity, \"Snapdrop & PairDrop for Android\" makes the everyday life of thousands of users easier. As an open source project we don't have any commercial interests but want to make the world a little bit better. Join and convince yourself!\n\nSOURCE CODE:\nhttps://github.com/fm-sys/snapdrop-android\n\nCREDIT:\nThe app is powered by the Snapdrop Open Source project, which is hosted and maintained by RobinLinus. See also https://www.github.com/robinlinus/snapdrop\n","repo":{"author":"fm-sys","repo":"https://github.com/fm-sys/snapdrop-android"},"version":"4c221d7a0c66c36680bf1fcfbf4cba9f737806e497943f3120545f3bad0d923c","site":null,"source":"https://github.com/fm-sys/snapdrop-android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}