{"appId":"com.berdik.letmedowngrade","appShortcutName":"Let Me Downgrade","appDisplayName":"Let Me Downgrade","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/David Berdik/https://github.com/DavidBerdik/Let-Me-Downgrade/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":31,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Add support for downgrading apps on Android 12 through 15 QPR1.\nAndroid's app installation system does not allow users to downgrade to an older version of an app when they already have a newer version installed. <i>Let Me Downgrade</i> is an Xposed module for Android 12 through 15 QPR 1 that enables users to bypass this restriction. As an added bonus, Let Me Downgrade provides a Quick Settings tile to easily enable and disable the downgrade block.\n\n<b>⚠️ WARNING:</b> <i>Let Me Downgrade</i> is intended for rooted devices running Android 12 through 15 QPR 1 and requires Xposed. The required Xposed variant to use is LSPosed. Other Xposed variants will not work. Additionally, this module cannot be guaranteed to work on all devices. In the worst case, it can cause a bootloop. Use at your own risk.\n\nTo use Let Me Downgrade:\n\n1. Install LSposed. This requires your device to be rooted with Magisk or KernelSU. Installation instructions for LSPosed are available <a href='https://github.com/LSPosed/LSPosed#install' target='_blank' rel='nofollow'>here</a>.\n2. Install Let Me Downgrade.\n3. Activate the Let Me Downgrade module in the LSposed user interface.\n4. Reboot your device and sign in.\n5. Open the quick settings panel. The Let Me Downgrade tile will appear.\n6. Toggle the Let Me Downgrade tile on or off to enable or disable it.","repo":{"author":"David Berdik","repo":"https://github.com/DavidBerdik/Let-Me-Downgrade"},"version":"b7416281c2c6bf7c9e73fa5812416822592eac518bece7c6de7a8254898ec608","site":null,"source":"https://github.com/DavidBerdik/Let-Me-Downgrade","license_or_tos":"AGPL-3.0-only","resources":null,"verified":false}