{"appId":"com.w2sv.filenavigator","appShortcutName":"File Navigator","appDisplayName":"File Navigator","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Janek Zangenberg/https://github.com/w2sv/FileNavigator/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":30,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"The missing link between Android and a well-sorted file system\n<b>Welcome to File Navigator - Your Ultimate File Sorting Solution!</b>\n\nAre you tired of cluttered files on your device? Seeking a streamlined way to organize and manage them? Look no further! File Navigator is here to transform your file management experience.\n\n<b>Key Features:</b>\n\n🔍 <b>File Type Customization: File Navigator puts you in control. Select the specific file types you want to navigate, including Images, Videos, Audio, Text, APKs, PDFs, and Archives.\n\n📁 <b>Effortless File Organization:</b> Configure the app to match your preferences. File Navigator allows you to define where different file types should be stored, ensuring they end up in the right place every time.\n\n📬 <b>Instant Notifications:</b> When new files of your chosen file types are detected in your system, File Navigator sends you instant notifications. No more surprises - you'll always be up-to-date.\n\n🚀 <b>Seamless File Movement:</b> With a simple tap from the notification, you can select the destination folder for the new file. No more manual searching and sorting.\n\n🛡️ <b>Precise Permissions:</b> To deliver these exceptional features, File Navigator requests the 'access to manage all files' permission. Rest assured, this permission is solely used to move files you explicitly command to be moved.\n\n📱 <b>Simplify Your Digital Life:</b> File Navigator is the ultimate solution to keep your files organized and readily accessible. Enjoy a clutter-free device and manage your files with ease.\n\nDon't let file chaos overwhelm you. Say goodbye to clutter and embrace the power of precise file management!\n","repo":{"author":"Janek Zangenberg","repo":"https://github.com/w2sv/FileNavigator"},"version":"ca1688860b966a94abb7534cd000ebae07827048f6f106c24710d69d9bd06cb5","site":null,"source":"https://github.com/w2sv/FileNavigator","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}