{"appId":"com.stoutner.privacycell","appShortcutName":"Privacy Cell","appDisplayName":"Privacy Cell","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Soren Stoutner/https://gitweb.stoutner.com/?p=PrivacyCell.git;a=summary/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":30,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Verify that a phone is using the most secure cell protocols.\nPrivacy Cell is a small app that displays the cell phone protocol information.\n\nAt the time of this writing, many cell phone networks are switching from 4G (4th Generation) to 5G networks. The 5G network protocols were specifically designed to protect against some of the known insecurities of the older protocols, including those that allowed stingrays (IMSI catchers) to perform man-in-the-middle attacks on cell phone networks. To ease deployment and backwards compatibility, 4G and 5G networks can run together in what is known as 5G NR (New Radio) NSA (Non-Standalone) mode. This uses the 4G network for the control channel and the 5G network for the data communication. However, 5G NR NSA does not provide protection against stingrays. Android has access to all the information it needs to know if it is connected to a 5G NR NSA or a 5G NR SA (Standalone) network, but it doesn’t display that information to the user. The purpose of Privacy Cell is to make that information easy to access.\n\nPrivacy Cell can also warn you when you are connected to antiquated 2G and 3G networks.","repo":{"author":"Soren Stoutner","repo":"https://gitweb.stoutner.com/?p=PrivacyCell.git;a=summary"},"version":"8c8599a81ddb91d75fabc16bd38decbd56960bfeb94fd644d07fd8606f3ba810","site":null,"source":"https://gitweb.stoutner.com/?p=PrivacyCell.git;a=summary","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}