{"appId":"com.marktka.calculatorYou","appShortcutName":"Calculator You: Math & Units","appDisplayName":"Calculator You: Math & Units","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/forzzzzz/Calculator-You/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":27,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Calculator You is a beautiful calculator for solving simple tasks.\nDiscover the ultimate calculator experience with our beautifully designed app, featuring 60+ stunning color themes to match your style. Whether you're tackling complex scientific equations or simple everyday calculations, our powerful and user-friendly interface makes it all easy.\n\nKey Features:\n\n🎨 Beautiful Design & 60+ Color Themes: Personalize your calculator with a choice of 60+ vibrant color themes, making every calculation visually enjoyable.\n\n🔬 Scientific Mode: Access advanced mathematical functions with our comprehensive scientific calculator, perfect for students, engineers, and math enthusiasts.\n\n🕒 History: Easily track and review previous calculations with our handy history feature, ensuring you never lose important work.\n\n📏 Unit Converter: Convert units effortlessly with our built-in converter, supporting a wide range of measurements, including length, weight, and more.\n\n👌 User-Friendly Interface: Enjoy a clean, intuitive interface designed for effortless navigation and efficient calculations.\n\nWhether you're a student, professional, or anyone in between, our calculator is your go-to tool for all your math and conversion needs. Download now and elevate your calculation experience!\n\nMade not with love❤️, but by love❤️.","repo":{"author":"Unknown","repo":"https://github.com/forzzzzz/Calculator-You"},"version":"ca793d0f025bc65ff476b150c0cb5db3151b36bfbb4c24c8a3f349e03a293e03","site":null,"source":"https://github.com/forzzzzz/Calculator-You","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}