{"appId":"com.mirfatif.mylocation","appShortcutName":"My Location","appDisplayName":"My Location","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Irfan Latif/https://github.com/mirfatif/MyLocation/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Know your geo coordinates using on-device GPS and Network location providers\n<big><b>Features:</b></big>\n\n<b>My Location</b> finds your device's location in the following ways:\n\n<b>-</b> <b>GPS</b> is usually the most accurate method. But a position fix may take some time or may not work at all due to signal loss. <b>Lock GPS</b> feature runs a persistent service to keep connected with the satellites.\n\nYou can also see the list of visible satellites with their PRNs (unique identifiers) and SNR (signal quality).\n\n<b>-</b> <b>Network Location Provider</b> uses Wi-Fi or Cellular ids to estimate the location. On the devices with Google Play Services installed, NLP usually uses Google Location Service at backend.\n\n<b>-</b> <b>UnifiedNLP</b> is an open source API which has been used to develop multiple NLP backends (https://github.com/microg/UnifiedNlp/wiki/Backends).\n\n<b>Furthermore:</b>\n<b>-</b> Location coordinates can be copied to clipboard or opened in a maps app, if installed.\n<b>-</b> Clearing A-GPS aiding data is also supported.\n\n<b>Note</b> that My Location is not a location provider like UnifiedNLP (or microG GmsCore). It just shows the location information received from AOSP location providers (GPS and Network) or directly from UnifiedNLP Backends (whichever are available on the device).\n","repo":{"author":"Irfan Latif","repo":"https://github.com/mirfatif/MyLocation"},"version":"3b55422a93bb084a553f4d8adba83b6416461e7468592a9e4a8e903e6b4afa0d","site":null,"source":"https://github.com/mirfatif/MyLocation","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}