{"appId":"com.pvpc.precio_luz","appShortcutName":"Precio Luz","appDisplayName":"Precio Luz","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Webierta/https://github.com/Webierta/precio-luz/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"Official electricity rate in Spain (PVPC)\n<p>Detailed information by hours on the price of electricity in Spain (PVPC) for efficient management of electricity consumption.</p><p>This App offers general and detailed information on the price of electricity (PVPC) and the cheapest and most expensive hours throughout a day to facilitate the adjustment of consumption habits by seeking savings in the electricity bill.</p><p>In short, this App tries to help manage electricity consumption more efficiently.</p><p>The App has been adapted to the new electricity tariff system that has been applied since June 1, 2021. One of the main changes introduced by the regulations is that all the customers covered by the PVPC are grouped under the same toll rate called 2.0 TD, which replaces the previous three (the default rate 2.0 A, the night rate 2.0 DHA, and the electric vehicle rate 2.0 DHS).</p><p>This new 2.0 TD rate has a time discrimination in three periods: peak, flat and valley that are defined according to the day of the week, the time of day and the geographical territory (different for Ceuta and Melilla).</p><p>The App includes a tool that calculates and orders the cheapest time bands of the day (average prices) for a certain interval of time. For example, it is useful to know the best time of day to run the washer and dryer consecutively.</p>\n","repo":{"author":"Webierta","repo":"https://github.com/Webierta/precio-luz"},"version":"50bebccb8100ca2304ba45875698b2b71456da8a73f8f34e25115801e3975b7f","site":null,"source":"https://github.com/Webierta/precio-luz","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}