{"appId":"com.github.samotari.cryptoterminal","appShortcutName":"CryptoTerminal","appDisplayName":"CryptoTerminal","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/samotari/crypto-terminal/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Secure Point of Sale cryptocurrency payment terminal\nCryptoTerminal is an open-source payment terminal app with which businesses\ncan accept in-person cryptocurrency payments. The app currently supports\nthe following payment options: Bitcoin, Litecoin, Monero, and Lightning\nNetwork (Bitcoin).\n\n<b>Business-Focused</b>\n\nIn-person payments are often neglected by app designers in the\ncryptocurrency space. That's why we have decided to focus on businesses, by\ndeveloping a payment solution that just works and doesn't bother you or\nyour customers with implementation details. Future releases of this app\nwill include full payment history exports with business accounting in mind,\nNFC payments, offline payment schemes, and more.\n\n<b>Resolves Common Issues</b>\n\nThe app will do its best to smooth over and resolve many of the common\ngotcha's associated with cryptocurrency payments so that you can focus your\nattention on running your business. Future releases of this app will\ninclude catching low-fee transactions at the time of payment,\nrebroadcasting transactions that were dropped from the memory pool, and\nmore.\n\n<b>Security and Privacy</b>\n\nYou are in complete control of your funds. It is impossible for your funds\nto be compromised by the app because it does not have access to your\nprivate keys. We follow industry best practices to maintain our users'\nsecurity and privacy, as well as provide explicit guidance wherever it\nmakes sense to do so.","repo":{"author":"Unknown","repo":"https://github.com/samotari/crypto-terminal"},"version":"bf8fd6d30e71f070efa901b2849799d433762894c76f47a46a4fa4ed99bbc0d5","site":null,"source":"https://github.com/samotari/crypto-terminal","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}