{"appId":"com.truchsess.send2car","appShortcutName":"send2car","appDisplayName":"send2car","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Norbert Truchsess/https://github.com/ntruchsess/send2car/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"send geo-locations to your bmw car from any app that allows sharing locations\nMany android apps allow to open a geolocation in another app like OSMAnd or Googlemaps. In most cases this is either done by clicking a 'share' or 'navigate to' action. Such action triggers a so call 'Intent' and Android will promt the user to select an app to be used to handle that.\nUnfortunally the original BMW Connected-app does not show up here.\nHere is where 'send2car' comes into play - is an app capable or receiving intents for the geo-url-sheme and translating this event into a connected-drive message to be send to your car. As Geo-intends besides the coordinates do not contain much detail when receiving such geo-url-intent send2car will do some reverse-geocoding to retrieve additional data and offer to send the result to a bmw car via the services provides by the BMW Connected-drive portal. The message being send to the car is equivalent to message that is sent from the Map that you can find in Connected-drive app or portal. Actually send2car does use the very same web-services that the connected-drive-portal web-app uses.\nWhen opening the message in your cars head-unit you can choose to navigate to the precise location that is encoded within the message.\nTo use you need to configure your connected-drive accout in send2car and retrieve the associated VINs from connected-drive portal.\n\n","repo":{"author":"Norbert Truchsess","repo":"https://github.com/ntruchsess/send2car"},"version":"af8e56221d2476ecfa1c467086c82c22274d8eb0f7ea827476392dbf2bc8f346","site":null,"source":"https://github.com/ntruchsess/send2car","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}