{"appId":"com.minar.birday","appShortcutName":"Birday - Birthday Manager","appDisplayName":"Birday - Birthday Manager","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/m-i-n-a-r/birday/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A simple yet useful birthday manager. Birday is free and ad-free! 🥳\n<h2><b>Introduction 👋</b></h2>\nThis app was created to remember and manage events in a simple and effective way.\nThe app contains some basic personalization options and an introduction, plus some new resources like animated vector drawables and the automatic dark/light theme. Support and updates are guaranteed!\n  \n\n<h2><b>Why should i use Birday? 😕</b></h2>\nWell, i'll tell you 3 main reasons:\n<ul>\n    <li> It can help you to remember every birthday in the moment you prefer! </li>\n    <li> It will cost just a few MB of storage! </li>\n    <li> It's beautiful, full of animations and simple to use! </li>\n</ul>\n\nBirday allows you to import the events directly from your contacts or calendar, with a simple favorite system and a set of stats to discover!\nif you're starting to develop apps and you need an app to look at, to find some inspiration and tricks: click on the Github link, and the Birday source code is served!\n  \n\n<h2><b>Features 🎂</b></h2>\n<ul>\n    <li> Simple events timeline, with the next date and the name of each person </li>\n    <li> Favorite system, to aggregate your favorite events and see more information </li>\n    <li> Overview screen and a lot of basic and advanced settings </li>\n    <li> Import birthdays from contacts or calendar with basic duplicate detection </li>\n    <li> Backup your events easily, in native, csv or json format\n    <li> 30+ language available. If you don't see your language, you can translate the app yourself! </li>\n    <li> Easily delete, modify or share every event </li>\n    <li> Each favorite event has an handy note field </li>\n    <li> Customizable notification the day of the event, and additional notification(s)! </li>\n    <li> Light, dark and black Amoled theme </li>\n    <li> Selectable accent and Monet accent (12 choices) </li>\n    <li> Hide and unhide the top cards for maximum ui flexibility </li>\n    <li> A quick search bar and type selector! </li>\n    <li> 2 customizable widgets </li>\n    <li> First introduction and beautiful animations including an animated notification icon </li>\n    <li> Simple and precise ui, following the material guidelines </li>\n</ul>\n\nPlease note: the notification system relies on the Android OS resources, thus some manufacturers may cause malfunctions. The reason is that some Xiaomi, Huawei and Oneplus devices kill the apps instead of simply closing it, or block the automatic startup of the app process. I can't fix this, but you can find more information on dontkillmyapp.com.\n  \n\n","repo":{"author":"Unknown","repo":"https://github.com/m-i-n-a-r/birday"},"version":"b855f3320fef7d30229078de84026b659aa478224c307bd486e3c25b2e3414a2","site":null,"source":"https://github.com/m-i-n-a-r/birday","license_or_tos":"MIT","resources":null,"verified":false}