{"appId":"com.futsch1.medtimer","appShortcutName":"MedTimer","appDisplayName":"MedTimer","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Florian Fetz/https://github.com/Futsch1/medTimer/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Med reminders and history with full offline privacy\nMed reminders and history with full offline privacy\n\nStay In Control of Your Medications with MedTimer\n\nMedTimer is an open-source medication reminder app designed to help you manage your medications and pills effectively and with full control of your sensitive data.\n\nFlexible & Personalized Reminders:\n\n- Manage unlimited medications with customizable reminders per medication (including simple defaults\n  for daily reminders).\n- Create flexible reminders with breaks and specific days (e.g. for birth control pills).\n- Weekend mode: Delay reminders to a defined time on chosen days.\n- Snooze notifications for later reminders or be reminded repeatedly.\n- Add extra doses on the fly.\n- Create interval based reminders or reminders following each other in intervals.\n\nSimple & Secure Data Management:\n\n- Confirm or dismiss reminders to record medication adherence accurately.\n- Get an overview of past doses in a chart and a tabular view.\n- Export your medication history as a CSV file for easy record-keeping or sharing with healthcare professionals.\n- Backup and restore your medication list as JSON file.\n- Medication stock tracking and out of stock reminders.\n- Tag and filter your medication.\n\nPrivacy & Offline Accessibility:\n\n- All data is stored securely on your device, ensuring complete privacy and offline accessibility.\n- No internet connection required – your medication reminders are always available.\n\nMedTimer is a free app without adds.\n\nSee the project page on GitHub: https://github.com/Futsch1/medTimer\n\nFeature graphic was created with https://hotpot.ai","repo":{"author":"Florian Fetz","repo":"https://github.com/Futsch1/medTimer"},"version":"57b8a123647a5ce2770672c8a4b2e3431b0cb89f3cb9ad3712f30e8ee224abd6","site":null,"source":"https://github.com/Futsch1/medTimer","license_or_tos":"MIT","resources":null,"verified":false}