{"appId":"de.kromke.andreas.cameradatefolders","appShortcutName":"Camera Date Folders","appDisplayName":"Camera Date Folders","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Andreas Kromke/https://gitlab.com/AndreasK/camera-date-folders/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Sort photos from camera folder into a date specific subfolder structure\nSorts all photos, located in the device's camera folder, into a date specific subfolder structure. This makes it easier to transfer specific photos to a computer, e.g. via USB cable (MTP protocol).\n\nEither keep photos inside the camera folder tree or move or copy them to a separate directory. This can also used as a simple backup method.\n\nUp to three levels are supported: year, month and day. The sorting can be reverted, i.e. all photos can be moved back to the base directory (but not back to the camera directory in case a destination directory is specified).\n\nOn the demand a file name prefix like \"IMG_\" or \"PXL_\" can be appended instead or completely removed. Note that this operation is not revertible.\n\nThe program does not read metadata (EXIF) from the photo files, instead it uses the data information encoded in the filenames.\n\nTo meet Google's restrictive policy, the Play Store variant of the program must use Google's proprietary Storage Access Framework when running on Android 11 or newer. As a consequence, file operations are extremely slow. This restriction partially exists also for older Android versions and not at all for the F-Droid version of the program. In this case standard file access calls can be activated alternatively, which accelerate the file operations with a factor of approximately 90 (!).","repo":{"author":"Andreas Kromke","repo":"https://gitlab.com/AndreasK/camera-date-folders"},"version":"63c09ace5a33a618e0d270411b8fb5864a8372dc810d0d800ac8458c4d086e7f","site":null,"source":"https://gitlab.com/AndreasK/camera-date-folders","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}