{"appId":"eu.neilalexander.yggdrasil","appShortcutName":"Yggdrasil","appDisplayName":"Yggdrasil","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Yggdrasil Developers/https://github.com/yggdrasil-network/yggdrasil-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Official implementation for connecting to the Yggdrasil Network from Android\nYggdrasil is an early-stage implementation of a fully end-to-end encrypted IPv6 network.\nIt is lightweight, self-arranging, supported on multiple platforms and allows pretty much any IPv6-capable application to communicate securely with other Yggdrasil nodes.\nYggdrasil does not require you to have IPv6 Internet connectivity - it also works over IPv4.\n\nThis app allows you to connect to Yggdrasil Network and use any service located in this network. It works as VPN service, but all your usual traffic will go trough your provider, not through Yggdrasil Network.\n\nAlso, it is not a goal of the Yggdrasil project to provide anonymity. Direct peers over the Internet will be able to see your IP address and may be able to use this information to determine your location or identity. Multicast-discovered peerings on the same network will typically expose your device MAC address. Other nodes on the network may be able to discern some information about which nodes you are peered with.\n\nAll traffic sent across the Yggdrasil network is encrypted end-to-end. Assuming that our crypto is solid, it cannot be decrypted or read by any intermediate nodes, and can only be decrypted by the recipient for which it was intended. However, please note that Yggdrasil has not been officially externally audited.","repo":{"author":"Yggdrasil Developers","repo":"https://github.com/yggdrasil-network/yggdrasil-android"},"version":"11ca701f71ca02f7f3d32b1b5625fca16e0c678bbc9f271f0ea63f6b5295227a","site":null,"source":"https://github.com/yggdrasil-network/yggdrasil-android","license_or_tos":"MIT","resources":null,"verified":false}