{"appId":"eu.veldsoft.broker","appShortcutName":"Broker 1961","appDisplayName":"Broker 1961","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Velbazhd Software LLC/https://github.com/VelbazhdSoftwareLLC/Broker-1961-for-Android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Very attractive board game which was created in 1961 for trading shares\nBuy and sell stock shares. By play of Market Action cards, strategically manipulate prices to your advantage and to the downfall of your opponents. Win by having the most money in cash and stocks after the last card has been played. But be careful: if all of your remaining stock holdings crash, it is possible to be eliminated before the game is even over.\n\nOriginally published in 1961 as Broker by the Spencer-Murray Corporation of Swarthmore, Pennsylvania.\n\nThe original box is white, with lettering and logo in black, very basic, drab, and uninspiring. Yet this obscure title was quite a gem considering the limitation of games to choose from during its day.\n\nIn 1967 it was re-published by the German firm Otto Maier Verlag, which is the ancestor of Ravensburger Spieleverlag GmbH Verlag. Numerous re-publications followed (1972, 1977 and others) including at least one which gave the rules in German, English and Italian. It was also published in the Ravensburger Casino Series.\nComponents list for these editions are as follows: 160 stock certificates, 68 Market Action cards, 4 price markers, play money, stock price board.\n\nThe 1983 (9th edition) by Ravensburger Spieleverlag GmbH changes the title slightly to Börsenspiel instead of Das Börsenspiel and the original rules heavily. Although this set is well-designed and much nicer on the eyes, the bland original version featured larger (regular card deck) size action cards. An extra set of 18 \"risk\" cards replacing 18 market cards had been added and they act as event cards that immediately effect changes in the market. They cause the unfortunate player who draws one to play it instead of a market card, a chaotic effect that some players will not like. Android version was implemented by Martin Kostadinov. It is school project for finish 12 grade.\n","repo":{"author":"Velbazhd Software LLC","repo":"https://github.com/VelbazhdSoftwareLLC/Broker-1961-for-Android"},"version":"606fb0f13434c71e5c80d71ac6f86fef0964450c75e98849a0b167b3cec3371a","site":null,"source":"https://github.com/VelbazhdSoftwareLLC/Broker-1961-for-Android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}