{"appId":"eu.webdragon.storygame","appShortcutName":"StoryGame","appDisplayName":"StoryGame","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/PrivacyDragon/https://github.com/PrivacyDragon/StoryGame_Android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"In this game the main goal is to make a story with the words you get.\nIn this game the main goal is to make a story with the words you get.\nYou can interpret the words in any way you like, that's what's so nice about the game. \nAlso: every story is correct, no matter if it's logical or not. So have fun and tell stories!\n\nGame rules:\n* You can interpret a word in many different ways. (That's one of the nice things about this game)\n* Every story is correct. It doesn't matter if it's logical or not, everything is correct.\n\nFurther gameplay information:\nOnce you run the program, sixteen words will be generated (*Pseudo-randomly taken from a list of hundred words). \nWith this words you should make a story, and you can interpret the words in any possible way. An important rule is that every story is correct. there are isn't any wrong story.\nYou can play the game in any way you like; You can make a story individually, but in a small group you can also do that everyone has to add something to the story so that someone begins with doing something with a word, then the next one goes further on it with another word, and then the next one does the same and so on.\nYou have two columns, one of them contains the words, the other is numbered from 1 to 16. Tap on a word you want to use, and it will get on the list with used words. They will come there in the order you tap them.\n\nIt is also possible to use custom words. You can choose to let the program use your own word list by clicking on the pencil icon and then selecting a text file with on each line a word.\n","repo":{"author":"PrivacyDragon","repo":"https://github.com/PrivacyDragon/StoryGame_Android"},"version":"6da4e665e9d35e3fd09d4fd230feebd6825f6e35718145f00e3246c1da9ef160","site":null,"source":"https://github.com/PrivacyDragon/StoryGame_Android","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}