{"appId":"gizz.tapes.foss","appShortcutName":"Gizz Tapes","appDisplayName":"Gizz Tapes","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/Ghost-Applications/gizz-tapes/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Stream King Gizzard and the Lizard Wizard shows right to your phone!\nDive into the electrifying world of King Gizzard and the Lizard Wizard with Gizz Tapes, your\none-stop app for live concert bootlegs! Curated from the vast archives of the Internet Archive,\nGizz Tapes lets you relive the band's legendary performances at the click of a button.\n\nWhat is Gizz Tapes?\nGizz Tapes is a jukebox for live recordings of King Gizzard and the Lizard Wizard shows. It’s a\nstrictly unofficial app with no ties to the band, designed for fans by fans. All audio is hosted\nand streamed directly from the Internet Archive, while artwork, show notes, and metadata are\nsourced from KGLW.net. Inspired by platforms like phish.in and Relisten, Gizz Tapes brings\ntogether audio from both the Live Music Archive and Community Audio collections, offering a\nseamless listening experience.\n\nWhy Gizz Tapes?\n\nMassive Library: Access a treasure trove of live performances, from explosive mosh-worthy sets to\nrare, intimate shows.\n\nEasy to Use: Queue up your favorite shows, explore curated collections, and enjoy high-quality\nstreaming.\n\nStay Updated: Follow Gizz Tapes on Bluesky or subscribe to our Atom feed to get notified when new\nshows are added.\n\nCommunity-Driven: Found a bug or have feedback? Raise an issue on our issue tracker or email us\ndirectly. Want to contribute? Check out our Git repo!\n\nSupport the Cause\nGizz Tapes wouldn’t be possible without the Internet Archive. Please consider making a donation to\nsupport their vital work in preserving digital culture and keeping the music alive for everyone.\n\nCrank up the volume, queue up your favorite show, and experience King Gizzard and the Lizard\nWizard like never before. Gizz Tapes: Because the jams don’t stop!\n","repo":{"author":"Unknown","repo":"https://github.com/Ghost-Applications/gizz-tapes"},"version":"2f94c2ea74c58484b835088d5e77e2eb5e93813d562016588ded455029519dd6","site":null,"source":"https://github.com/Ghost-Applications/gizz-tapes","license_or_tos":"Apache-2.0","resources":null,"verified":false}