{"appId":"godau.fynn.usagedirect.system","appShortcutName":"Museum of a broken API","appDisplayName":"Museum of a broken API","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Fynn Godau/https://codeberg.org/fynngodau/usageDirect/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Warns against using a system usage stats API\n<b>Please install <a href=\"https://f-droid.org/packages/godau.fynn.usagedirect\">usageDirect</a> instead of this app if you are interested in system usage statistics.</b>\n\n<i>This app reflects my experience with the usagae statistics API from a few Android versions ago. It may no longer be current and this app is no longer being maintained.</i>\n\nThe Android system collects app usage statistics in the background; however, native Android contains no way to read out this data properly. That is why I wanted to create a tool to display it. Unfortunately, I had to learn that this data source was riddled with bugs and highly unreliable.\n\nThus, I converted this application into a museum. It exhibits aggregated usage statistics per day for usually the past ten days, per week for the past four weeks, per month for the past six months as well as data aggregated by year. As a special exhibition, it can display this data as charts.\n\nDesign-wise, the app comes in the style of the settings app to highlight that this API is a part of the Android system.\n\nAn included Guide to the exhibition names some of the issues you can expect to find on your tour.\n","repo":{"author":"Fynn Godau","repo":"https://codeberg.org/fynngodau/usageDirect"},"version":"6b5d4304c093e623af6719ef036171e623851a38b05245624321350b69c5e3f4","site":null,"source":"https://codeberg.org/fynngodau/usageDirect","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}