{"appId":"ie.defo.ech_apps","appShortcutName":"DEfO ECH Apps","appDisplayName":"DEfO ECH Apps","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/defo-project/defo-ech-apps/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":22,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Experimental fork of F-Droid to use TLS ECH with Cloudflare as the default host\nThis is a demo fork of F-Droid to serve as an example app built on the\ndevelopment fork of Conscrypt which supports TLS Encrypted ClientHello\n(ECH).  ECH is the next version of the TLS protocol that encrypts\ninternet traffic and puts the \"S\" in HTTPS.  It makes it possible to\nencrypt all of the metadata that is possible to encrypt in the TLS\nnegogiation. It is a test case for interoperability between various\nimplementations, platforms, and networks.\n \nThe Encrypted ClientHello (ECH) mechanism (IETF draft spec) is a way to\nplug a few privacy-holes that remain in the Transport Layer Security\n(TLS) protocol that's used as the security layer for the web. OpenSSL\nis a widely used library that provides an implementation of the TLS\nprotocol. The DEfO project is developing an implementation of ECH for\nOpenSSL, and various clients and servers that use OpenSSL as a\ndemonstration and for interoperability testing.\n\nThis uses the mirror of f-droid.org that is on Cloudflare with ECH\nenabled: https://cloudflare.f-droid.org\n\nDEfO was initially funded by the Open Technology Fund, and\nsubsequently by the National Democratic Initiative. Tolerant Networks\nLtd. and people from the Guardian Project are doing the work in DEfO.\n","repo":{"author":"Unknown","repo":"https://github.com/defo-project/defo-ech-apps"},"version":"cfc293b6a1147f88ec1c05e40ef39baaadbd78383e8fd0cc49ef631e4507b921","site":null,"source":"https://github.com/defo-project/defo-ech-apps","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}