{"appId":"im.vector.app","appShortcutName":"Element - Secure Messenger","appDisplayName":"Element - Secure Messenger","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/New Vector Ltd./https://github.com/vector-im/element-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["X64"]}},"displayImages":[],"description":"Group messenger - encrypted messaging, group chat and video calls\nElement is both a secure messenger and a productivity team collaboration app that is ideal for group chats while remote working. This chat app uses end-to-end encryption to provide powerful video conferencing, file sharing and voice calls.\n\n<b>Element’s features include:</b>\n- Advanced online communication tools\n- Fully encrypted messages to allow safer corporate communication, even for remote workers\n- Decentralized chat based on the Matrix open source framework\n- File sharing securely with encrypted data while managing projects\n- Video chats with Voice over IP and screen sharing\n- Easy integration with your favourite online collaboration tools, project management tools, VoIP services and other team messaging apps\n\nElement is completely different from other messaging and collaboration apps. It operates on Matrix, an open network for secure messaging and decentralized communication. It allows self-hosting to give users maximum ownership and control of their data and messages.\n\n<b>Privacy and encrypted messaging</b>\nElement protects you from unwanted ads, data mining and walled gardens. It also secures all your data, one-to-one video and voice communication through end-to-end encryption and cross-signed device verification.\n\nElement gives you control over your privacy while allowing you to communicate securely with anyone on the Matrix network, or other business collaboration tools by integrating with apps such as Slack.\n\n<b>Element can be self-hosted</b>\nTo allow more control of your sensitive data and conversations, Element can be self-hosted or you can choose any Matrix-based host - the standard for open source, decentralized communication. Element gives you privacy, security compliance and integration flexibility.\n\n<b>Own your data</b>\nYou decide where to keep your data and messages. Without the risk of data mining or access from third parties.\n\nElement puts you in control in different ways:\n1. Get a free account on the matrix.org public server hosted by the Matrix developers, or choose from thousands of public servers hosted by volunteers\n2. Self-host your account by running a server on your own IT infrastructure\n3. Sign up for an account on a custom server by simply subscribing to the Element Matrix Services hosting platform\n\n<b>Open messaging and collaboration</b>\nYou can chat with anyone on the Matrix network, whether they’re using Element, another Matrix app or even if they are using a different messaging app.\n\n<b>Super secure</b>\nReal end-to-end encryption (only those in the conversation can decrypt messages), and cross-signed device verification.\n\n<b>Complete communication and integration</b>\nMessaging, voice and video calls, file sharing, screen sharing and a whole bunch of integrations, bots and widgets. Build rooms, communities, stay in touch and get things done.\n\n<b>Pick up where you left off</b>\nStay in touch wherever you are with fully synchronised message history across all your devices and on the web at https://app.element.io\n\n<b>Open source</b>\nElement Android is an open source project, hosted by GitHub. Please report bugs and/or contribute to its development at https://github.com/element-hq/element-android\n","repo":{"author":"New Vector Ltd.","repo":"https://github.com/vector-im/element-android"},"version":"de5ef742a2b7812d613c9fc0aa31640b7d611b24f34b88fb505e4b725ec25b96","site":null,"source":"https://github.com/vector-im/element-android","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}