{"appId":"io.element.android.x","appShortcutName":"Element X - Secure Chat & Call","appDisplayName":"Element X - Secure Chat & Call","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/New Vector Ltd./https://github.com/vector-im/element-x-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["X86"]}},"displayImages":[],"description":"Sovereign. Seamless. On Matrix\nElement X brings you both sovereign & seamless collaboration built on Matrix.\n\nThe collaboration capabilities include chat & video calls with the modern set of features such as:\n • public & private channels\n • room moderation & access control\n • replies, reactions, polls, read receipts, pinned messages, etc.\n • simultaneous chat & calls (picture in picture)\n • decentralized & federated communication across organizations\n\nAll this comes in a secure & sovereign fashion without compromising responsiveness or overall usability of the app:\n • enterprise-grade single sign-on\n • easy & secure login & device verification via QR-code\n • end to end encryption & zero trust\n • protection against MITM & other cyber attacks\n\nIf you’re a new user, use the new Element X app from the start. Compared to the current Element app you will get:\n • greatly enhanced performance, sleek user interface and overall better user experience\n • enterprise-grade support for single sign-on (OIDC)\n • QR-code based login & device verification\n • natively integrated Element Call for video calls\n • continuous improvements, bug fixes and new features\n\nIf you’re an existing user, using the current Element app - check out the new Element X and start planning your transition. The current Element app will be phased out and will only get critical security updates.\n\n<b>Own your data</b>\nMatrix-based, Element X lets you self-host your data or choose from any free public server (the default is matrix.org, but there are plenty of others to choose from). However you host, you have ownership; it’s your data. You’re not the product. You’re in control.\n\n<b>Interoperate natively</b>\nEnjoy the freedom of the Matrix open standard! You have native interoperability with any other Matrix-based app. So just like email, it doesn't matter if your friends, partners or customers are on a different Matrix-based app - you can still connect.\n\n<b>Encrypt your data</b>\nEnjoy your right to private conversations - free from data mining, ads and all the rest of it - and stay secure. Only the people in your conversation can read your messages.\n\n<b>Chat across multiple devices</b>\nStay in touch wherever you are with fully synchronized message history across all your devices, even those running Element legacy app, and on the web at https://app.element.io\n\nThe application requires the android.permission.REQUEST_INSTALL_PACKAGES permission to enable the installation of applications received as attachments, ensuring seamless and convenient access to new software within the app.\n\nThe application requires the USE_FULL_SCREEN_INTENT permission to ensure our users can effectively receive call notifications even when their devices are locked.\n","repo":{"author":"New Vector Ltd.","repo":"https://github.com/vector-im/element-x-android"},"version":"5b4975ee25b0bdc2ac19cd4621f6e721e2d1d771b66a81f86ed5cf77b2432d71","site":null,"source":"https://github.com/vector-im/element-x-android","license_or_tos":"AGPL-3.0-or-later","resources":null,"verified":false}