{"appId":"io.github.sspanak.tt9","appShortcutName":"Traditional T9","appDisplayName":"Traditional T9","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Dimo Karaivanov/https://github.com/sspanak/tt9/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A T9 keyboard for devices with a hardware keypad.\nTT9 is a 12-key T9 keyboard for devices with a hardware numpad. It supports predictive text typing in 30+ languages, configurable hotkeys, and an on-screen keypad that can turn your smartphone into a Nokia from the 2000s. And, best of all, it doesn't spy on you!\n\nSupported languages: Arabic, Bulgarian, Catalan, Croatian, Czech, Danish, Dutch, English, Estonian, Farsi, Finnish, French, German, Greek, Gujarati (phonetic), Hebrew, Hindi (phonetic), Hinglish, Hungarian, Indonesian, Irish, Italian, Kiswahili, Korean, Latvian, Lithuanian, Norwegian, Polish, Portuguese (European and Brazilian), Romanian, Russian, Slovenian, Spanish, Swedish, Moroccan Tamazight (Latin and Tifinagh), Thai, Turkish, Ukrainian, Vietnamese, Yiddish.\n\nPhilosophy and Privacy Policy:\n- No ads, no premium or paid features. It's all free.\n- No spying, no tracking, no telemetry or reports. No nothing!\n- No unnecessary bells or whistles. It only does its job, typing.\n- The Full version operates entirely offline with no Internet permission. The Lite version connects only when downloading dictionaries from GitHub and when the voice input is active.\n- Open-source, so you can verify all the above yourself.\n- Created with help from the entire community.\n- Things it will (probably) never have: QWERTY layout, swipe-typing, GIFs and stickers, backgrounds or other customizations. \"It can be any color you like, as long as it is black.\"\n- Not intended as a clone of Sony Ericsson, Nokia C2, Samsung, Touchpal, etc. It is understandable to miss your favorite old phone or keyboard app, but TT9 has its own unique design, inspired by the Nokia 3310 and 6303i. While it captures the feel of the classics, it offers its own experience and won’t replicate any device exactly. \n\nThank you for understanding, and enjoy TT9!\n","repo":{"author":"Dimo Karaivanov","repo":"https://github.com/sspanak/tt9"},"version":"8bd4ec641c50f08af23da6f91c19e73f134d3a83379d1987593b057b96c272b2","site":null,"source":"https://github.com/sspanak/tt9","license_or_tos":"Apache-2.0","resources":null,"verified":false}