{"appId":"io.github.benderblog.traintime_pda","appShortcutName":"Traintime PDA","appDisplayName":"Traintime PDA","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/BenderBlog Rodriguez/https://github.com/BenderBlog/traintime_pda/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":22,"abi":["Aarch64"]}},"displayImages":[],"description":"Open Source data assistant for XDU students.\n\"Traintime PDA\" is an open-source personal data assistant for XDU students.\n\nThe XDYou app in the Apple App Store have the same codebase as this.\n\n - Both undergraduates and postgraduates are supported.\n - View classtable with exam arrangement and experiment arrangement, also set your idol as the background, or exchange the classtable with your sweetie.\n - View sport related data: sport class detail and test score. (Punch machine will be sorely missed)\n - Check your dorm's electricity balance and (maybe) pay your electricty fee. (Postgraduates shall enter the electricity account manually)\n - View your grade and easily calculate GPA and average score by choosing the subjects. (Postgraduates cannot count your GPA and average score, sry)\n - View the exam schedule by semester.\n - View the due time of the borrowed books and query the details of the books in the library.\n - View the bill you spent in the cafeteria.\n - Empty classroom check. (Not avaliable for postgraduates)\n - Physics experiment schedule check and output to iCalendar.\n - Other tools such as call for repairing, school email, etc.\n - XDU Planet: Look around the blogs of your schoolmates.\n - Physics experiment check.\n - Schoolnet Query.\n - Homepage widget.\n\nIf you got some idea about it, contact me freely.\n","repo":{"author":"BenderBlog Rodriguez","repo":"https://github.com/BenderBlog/traintime_pda"},"version":"c86ccd5bf026acb2a499f1fdcfc2b27522b25593402f88a6ce6670fce4074f3c","site":null,"source":"https://github.com/BenderBlog/traintime_pda","license_or_tos":"MPL-2.0","resources":null,"verified":false}