{"appId":"io.gitlab.carsten_scholtes.parti","appShortcutName":"Parti","appDisplayName":"Parti","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Carsten Scholtes/https://gitlab.com/carsten_scholtes/parti/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64"]}},"displayImages":[],"description":"Help with partitioning into fractional parts (compute lcm).\n<p>\nParts are usually specified in the form of fractions as divident / divisor.\nWith different parts using different divisors it is difficult to compare the sizes of the parts.\nThe main gist of Parti is to determine the least common multiple (lcm) of all different divisors.\n(The different parts can be expressed using the lcm as common divisor making the parts easily comparable.)\n</p>\n\n<p>\nDivisors are represented and processed as BigInts in order to provide exact results.\n(BigInts are designed to store whole values of arbitrary size, as long as enough memory is available.)\n</p>\n\n<p>General Usage:</p>\n<ul>\n  <li>\n    After entering a divisor in the central editor widget\n    it can be added / removed with the button to the right of the input field.\n    The list of divisors in the bottom section is changed accordingly.\n    Also, lcm and gcd in the top section are updated to reflect the new list of divisors.\n  </li>\n  <li>\n    Tapping a value in the list puts the value into the editing widget.\n    Dragging a list value to the left removes it from the list and puts it into the editor widget.\n    Dragging a list value to the right removes it without changing the editor widget.\n  </li>\n  <li>\n    In the top bar, a button for clearing the whole list is available.\n    There are also buttons for undoing and redoing any changes of the current session.\n  </li>\n  <li>\n    The value of the gcd can be changed deliberately\n    with any change modifying the list of divisors accordingly:\n    Tapping the value of the gcd opens a requester to replace the gcd with an arbitrary whole number.\n    There is a button to set it to 1 (or to the value it had before it was set to 1).\n    Further buttons increase or decrease the gcd by 1.\n  </li>\n</ul>\n","repo":{"author":"Carsten Scholtes","repo":"https://gitlab.com/carsten_scholtes/parti"},"version":"32f30a3184df5308a9580a1c532ed7b936c9b3241b438662a813661ab81c5583","site":null,"source":"https://gitlab.com/carsten_scholtes/parti","license_or_tos":"BSD-3-Clause","resources":null,"verified":false}