{"appId":"io.horizontalsystems.bankwallet","appShortcutName":"Unstoppable Crypto Wallet","appDisplayName":"Unstoppable Crypto Wallet","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Horizontal Systems/https://github.com/horizontalsystems/unstoppable-wallet-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":27,"abi":["Aarch64","Armv7"]}},"displayImages":[],"description":"Bitcoin, Ethereum, DeFi\nUnstoppable wallet is purposely built as a decentralized management tool for cryptocurrencies.\n\nIt is engineered to serve privacy-conscious individuals looking to manage and invest in Bitcoin, Ethereum and other cryptocurrencies in a sovereign and professional manner.\n\nUnstoppable is built with the following in mind:\n\n- Capital Should Be Free >> It’s built to provide users with genuinely independent control over their capital.\n\n- Capital Should Be Borderless >> It works outside the traditional finance layer and acts as a Swiss knife to the world of decentralized finances (DeFi).\n\n- Capital Should Be Private >> It doesn’t leak private data, it has no means to track users, and takes extra measures to ensure privacy on multiple layers.\n\nIf the above rhymes well with you then Unstoppable is for you! And we are here to focus on your unique needs and serve you in the best possible manner.\n\nWALLET FEATURES:\n\n- Non-Custodial Multi-wallet >> Manage any number of cryptocurrencies across multiple portfolio-style wallets in a non-custodial manner. This wallet is like your own bank where you are the only client and the only one in charge. It’s designed to keep assets secure and easy to restore even if the phone is stolen and tampered with.\n\n- Investment Oriented Wallet >> Unstoppable brings unmatched cryptocurrency market analytics to your device: advanced sorting, curated categorization, extensive search filtering, and event-based alerting features.\n\n- Universal Wallet >> It supports all mainstream blockchains and is built in a standard compliant manner enabling users to use just one wallet app for everything crypto.\n\n- A Bitcoin Wallet >> The wallet packs some of the most advanced Bitcoin features available: SPV enabled, BIP 44/49/84/86/69 compliant, Bitcoin timelocks, custom transaction fees, and more.\n\n- A DeFi Wallet >> Full support for decentralized token swaps on Ethereum, Binance Smart Chain, Polygon, Avalanche, Solana, and more. Also, the ability to interact with any smart contract-powered service on the blockchain via the WalletConnect protocol.\n\n- Ethereum Wallet >> Full support for Ethereum blockchain, its growing ecosystem of tokens (ERC20, NFT tokens, etc.), and other decentralized services such as ENS (Ethereum Name Service).\n\n- Ethereum L2 Wallet >> Artbitrum, Optimism, Polygon support.\n\n- Avalanche Wallet >> Full support for Avalanche C-Chain blockchain.\n\n- Binance Wallet >> Full support for original Binance Chain (incl. BEP2) and Binance Smart Chain.\n\n- Crypto Academy >> The app includes two courses meant to onboard newcomers into the world of cryptocurrencies and the DeFi ecosystem in an easy-to-digest manner covering essential aspects of cryptocurrency security, storage, privacy, transacting, and exchanging.\n\n- Wallet for Privacy Coins >> Fully supports major privacy coins (ZCash, DASH) in an SPV manner. One of the very few wallets capable of supporting fully shielded Zcash transactions as well as the ability to privatize Bitcoin transactions.\n\n- Decentralized Wallet >> Designed to work with most major blockchains in a decentralized manner where an app doesn't depend on some server of a wallet provider to send/receive transactions but interacts with blockchain networks directly.\n\n- Privacy Focused >> Designed to allow for privacy even in the most privacy-breaching scenarios. There are no user accounts keeping your records, no identity checks that risk exposing your financials to the world, and no interaction with traditional finance layers. The app is partially TOR enabled and VPN support coming soon.\n\n- Fully Open Source >> The most transparent wallet application built to date. The entire 4-year production process of the app is openly accessible online along with 100% of its code for anyone to evaluate or reuse in other projects. Verified and audited by third parties.\n\nBe Unstoppable!","repo":{"author":"Horizontal Systems","repo":"https://github.com/horizontalsystems/unstoppable-wallet-android"},"version":"598f1ba369f44b86ce680dbcf59922049185a01b8b700c238660b65b5c691724","site":null,"source":"https://github.com/horizontalsystems/unstoppable-wallet-android","license_or_tos":"MIT","resources":null,"verified":false}