{"appId":"io.librehealth.mhbs.essential_care_for_every_baby","appShortcutName":"LibreHealth Essential Care For Every Baby","appDisplayName":"LibreHealth Essential Care For Every Baby","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/LibreHealth/https://gitlab.com/librehealth/incubating-projects/mhbs/lh-mhbs-eceb/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X64"]}},"displayImages":[],"description":"A Newborn Baby Care Support App \n🎉 Welcome to LibreHealth Essential Care For Every Baby Project\n\nThis is an Android application to provide clinical decision-support for nurses and doctors delivering essential newborn care interventions during the first day of life. This application provides knowledge, skills, and competencies to nurses and doctors in low/middle-income settings so that they can provide life-saving care to newborns from birth through 24 hours postnatal. App uses DHIS2 as backend & can be setup for any hospital/organization\n\nFeatures\n\n- Ability to track multiple babies at a time\n\n- Time-stamping births to generate an essential newborn care clock for each baby being tracked in the app\n\n- Automated classification of babies health status, based on results from observations and assessments that are conducted during the first 2 hours after birth\n\n- Automated advice on management of babies, based on their classification; Reminders/alerts to provide recommended essential newborn care interventions\n\n- If particular interventions are not delivered on time, or at all, capture of information regarding why this essential newborn care was late, or missed\n\nDownload the Android application now and check it out!\n","repo":{"author":"LibreHealth","repo":"https://gitlab.com/librehealth/incubating-projects/mhbs/lh-mhbs-eceb"},"version":"fb028933f32fa96fba18602b8ffb290adad9075d3eb418af123b47d229005280","site":null,"source":"https://gitlab.com/librehealth/incubating-projects/mhbs/lh-mhbs-eceb","license_or_tos":"MPL-2.0","resources":null,"verified":false}