{"appId":"io.rosenpin.screenshotsharer","appShortcutName":"QuickShot: Share Screenshot","appDisplayName":"QuickShot: Share Screenshot","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Tomer Rosenfeld/https://github.com/rosenpin/Screenshot-Sharer/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":29,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Share screenshots quickly\nTransform the way you capture and share screenshots with QuickShot Share – the fastest screenshot sharing app. Say goodbye to the tedious process of taking a screenshot, opening your gallery, and then sharing it. QuickShot Share streamlines this entire workflow into a single, swift action.\n\n🚀 Quick and Easy:\nLong-press your home or power button (depending on your device), and QuickShot Share jumps into action. It’s the quickest method out there - perfect for capturing fleeting moments or sharing live screen information.\n\n📸 Instant Screenshot Capture:\nWith QuickShot Share, a screenshot is captured instantly with the gesture you already use. Whether it's a long press of the power button or another gesture, we've got you covered. Compatibility varies with devices, but most new models support this intuitive feature.\n\n🌐 Immediate Sharing:\nThe moment your screenshot is taken, a share dialog appears. No delays, no need to switch apps. Share your screenshots instantly with any social media, messaging app, email, or cloud storage.\n\n🔧 Customizable and User-Friendly:\nQuickShot Share is designed for efficiency and ease of use. It integrates seamlessly into your device's system, replacing the assistant gesture for straightforward access.\n\n📱 Device Compatibility:\nDesigned for newer devices, QuickShot Share supports most recent models and standard gestures. Experience may vary based on your device's unique specifications.\n","repo":{"author":"Tomer Rosenfeld","repo":"https://github.com/rosenpin/Screenshot-Sharer"},"version":"8247f4f3dd93f89baf45f4af6a2e0ba09511415a45fe5f575e0c4cb2cb07fe8e","site":null,"source":"https://github.com/rosenpin/Screenshot-Sharer","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}