{"appId":"luci.sixsixsix.powerampache2.fdroid","appShortcutName":"Power Ampache 2","appDisplayName":"Power Ampache 2","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Icefields/https://github.com/icefields/Power-Ampache-2/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Music Streaming suite for Ampache, Nextcloud Music and compatible backends.\nPower Ampache 2 is a feature-rich music client designed for Ampache, Nextcloud Music and compatible backends. It offers all the features found in other mainstream music players, such as Spotify, YouTube Music, and Apple Music, and more. With Power Ampache 2, enjoy “actually” downloading and exporting music files, access to lyrics, multi-account support, and an ad-free, tracking-free experience.\n\nPlease let me know if you encounter any issue, I'll be happy to fix any reported bug.\n\n— Unique generated playlists (smartlists)\n— “Spin it!” button to generate a playlist for you.\n— Dark & light mode with adaptive interface colours, or choose/create your own theme.\n— Media keys support\n— Every Bluetooth functionality is available in the app.\n— Song notifications with play controls. Also on lock screen.\n— Album, Artist, Songs collections\n— Advanced search\n— Powerful offline mode\n— Create, edit, share your playlists\n\n📱 CONNECT TO AMPACHE MUSIC SERVERS\nWith Power Ampache 2, you can effortlessly connect to Ampache servers and freely listen to music, without any tracker or ads. You can even download the music you want for offline use, or share with friends.\n\n🚀 LIGHTNING-FAST AND LIGHTWEIGHT:\nDespite its powerful features, Power Ampache 2 boasts a remarkable performance, making it quick and easy to listen music at full quality (FLAC support coming soon), create your own playlists (public or private) and queue. Experience speed and efficiency while enjoying your favourite music.\n\n🔐 ENHANCED PRIVACY:\nYour data is not collected and sold, there are no ads in the app.\n\n🔍 EFFICIENT SONG SEARCH:\nPower Ampache 2 provides a quick and efficient search for finding songs/albums/artists/playlists. Find what you need, when you need it.\n\n🌈 MODERN DESIGN & USER-FRIENDLY INTERFACE:\nEnjoy a clean, modern design with a user-friendly interface. The app features a material3 design, MaterialYou and other themes, providing a visually appealing and comfortable user experience.\n\n🌐 OPEN-SOURCE TRANSPARENCY:\nPower Ampache app is completely free of ads and does not request unnecessary permissions. Moreover, it is fully open-source, providing you with peace of mind, as you have access to the source code for security and privacy audits.\n\nConsider donating to support the project or requesting new features.\nWork in progress / Coming soon:\n— Widgets\n— Playlist edit drag and drop\n— Android Auto\n— Multi-account features\n— Android TV\n— UI Optimized for tablets\n\nBecome my Patreon: https://www.patreon.com/Icefields\nBuy Me a Coffee: https://buymeacoffee.com/powerampache\n","repo":{"author":"Icefields","repo":"https://github.com/icefields/Power-Ampache-2"},"version":"b5d8ef6c1eb835324de9406538f29a6f2917e06b1dc0d754b290a0f550c9993e","site":null,"source":"https://github.com/icefields/Power-Ampache-2","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}