{"appId":"me.bgregos.brighttask","appShortcutName":"Foreground","appDisplayName":"Foreground","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/bgregos/foreground/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Task manager app, supporting syncing with Taskwarrior.\n<p>Foreground is an easy to use task manager app. Designed to be beautiful,\nsimple and unintrusive, Foreground helps you know what needs done without\ngetting in your way. Foreground also supports syncing with <a\nhref=\"https://taskwarrior.org/\">Taskwarrior</a> servers.</p>\n\n<h2 id=\"syncing\">Syncing</h2>\n\n<p>To set up sync, add your taskwarrior server credentials (provided by your\ntaskd server or a service like inthe.am or FreeCinc) to the settings menu, and\nenable sync using the toggle. A test will be run to check if the settings are\nvalid, and the enable will stick if the config works. You can also configure\nautomatic syncing in this menu, or click the sync button on the main page to\nstart a sync.</p>\n\n<h2 id=\"implementation-details\">Implementation Details</h2>\n\n<p>Unlike existing Taskwarrior apps for Android, Foreground does not run the\ntaskwarrior binary inside, but rather implements a taskwarrior sync client.\nThis allows for greater device compatibility and simplifies UI development but\nit can cause issues when syncing if not done correctly.</p>\n\n<h2 id=\"current-limitations\">Current Limitations</h2>\n\n<p>Foreground currently supports most features of Taskwarrior. Notable\nexceptions involve handling of recurring events and display/editing of User\nDefined Attributes. Recurring event instances created by other clients will be\nshown by Foreground, but Foreground does not create recurring event instances\nof its own at this time.  User Defined attributes are preserved internally but\nare not yet exposed for viewing or editing.  These limitations will be resolved\nin future releases.</p>\n","repo":{"author":"Unknown","repo":"https://github.com/bgregos/foreground"},"version":"5444c39deeb073db92352a59bed950173a055db4774bbdc94dde547bfdee351a","site":null,"source":"https://github.com/bgregos/foreground","license_or_tos":"Apache-2.0","resources":null,"verified":false}