{"appId":"me.lecaro.breakout","appShortcutName":"Breakout 71","appDisplayName":"Breakout 71","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Renan LE CARO/https://gitlab.com/lecarore/breakout71/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Break colourful bricks, catch bouncing coins and select powerful upgrades !\n<!-- Break colourful bricks, catch bouncing coins and select powerful upgrades ! -->\n\n<p>\nThis is a roguelite twist on the original Breakout/Arkanoid formula.\nThe goal is to catch as many coins as possible during 7 levels.\nCoins appear when you break bricks.\nThey fly around, bounce and roll, and you need to catch them with your puck.\nYour \"combo\" is the number of coins spawned when a brick breaks, it is displayed on your puck.\nYour score is displayed in the top right corner of the screen.\n</p>\n\n<p>\nAt the end of each level, you get to pick an upgrade from a random selection, vampire-survivor style.\nMany upgrades impact your \"combo\". Upgrades apply to the whole run and can synergize.\nFor example, \"hot start\" increases your combo greatly at the start of each level, but makes it tick down rapidly.\nIf you combine it with \"+1 ball\", \"piercing\" and \"bricks become bombs\", you'll clear levels so fast that the combo\nwill still be high when the fireworks are over and your puck will be showered by coins.\n</p>\n\n<p>What decides how the ball flies away is only the position of the puck hit.\nThe puck speed and incoming angle have no impact.\nYou must delete all bricks to progress to the next level, and never drop the ball.\n</p>\n\n<p>\nAfter clearing a level, you'll be able to pick upgrades among a small selection presented to you.\nThey'll apply until the end of the run.\nA normal run lasts 7 levels, after which your score is recorded, and you can start again.\n</p>\n\n<p>\nEach run is different, the levels and upgrades you see will change every time, and new ones get added to the pool\nwhen you progress in the game.\n</p>\n\n<p>\nThe app should work offline and perform well even on low-end devices.\nIt's very lean and does not take much storage space (Roughly 0.1MB).\nIf the app stutters, turn on \"fast mode\" in the settings to render a simplified view that should be faster.\n</p>\n\n<p>\nThere's also an easy mode for kids (slower ball) and a color-blind mode (no color related game mechanics).\n</p>","repo":{"author":"Renan LE CARO","repo":"https://gitlab.com/lecarore/breakout71"},"version":"df5e9f9937678947cf35e3c78287e2865678c3d8a781a08d124436d4e08a6827","site":null,"source":"https://gitlab.com/lecarore/breakout71","license_or_tos":"AGPL-3.0-only","resources":null,"verified":false}