{"appId":"mobi.meddle.wehe","appShortcutName":"Wehe","appDisplayName":"Wehe","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Northeastern University Wehe Project/https://github.com/NEU-SNS/wehe-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"This is an app to help you identify traffic differentiation in your network!\nWehe is an app that runs tests against your network and analyzes the results to let you know if your network provider is restricting or prioritizing traffic for certain applications and certain ports.\n\nBy performing free tests with Wehe on your mobile device, you are participating in an IRB-approved research project at Northeastern University (led by Dr. David Choffnes) and you are helping to identify potential violations of net neutrality. Note that no conclusion can be drawn from an individual result of the type \"Differentiation detected\" to characterize a breach of Regulation (EU) 2015/2120 on Open Internet.\n\nAs net neutrality regulations vary according to location, Wehe collects coarse-grained geolocation data (with a precision of 0.1 degrees latitude/longitude) if users explicitly opt in to providing it. Wehe never collects fine-grained geolocation information. Wehe also collects IP addresses, which are stored as truncated data so they cannot be tied to individuals. As such, all the collected data are deidentified to guarantee the protection of personal data. The deidentified data are published as open data to let third parties reproduce the conclusions of the tests carried out. Finally, Wehe uses servers located around the world, including ones hosted by Measurement Lab (M-Lab). M-Lab collects additional measurement data from clients, but does so in a way that is consistent with Wehe’s protections against collecting personal data. Note that the set of servers and hosts may change over time, but our privacy policy and data protection practices remain the same.\n\nNo personal data are either transferred, or exchanged, or rented. In accordance with the General Data Protection Regulation (EU) n°2016/679, please note that you have the right to oppose, access, rectify, delete, limit or transfer your personal data.\n\nFor more details about the app, the research behind it, and analysis of data collected about net neutrality violations, please visit: <a href=\"https://wehe.meddle.mobi/\">https://wehe.meddle.mobi</a>.","repo":{"author":"Northeastern University Wehe Project","repo":"https://github.com/NEU-SNS/wehe-android"},"version":"33e28fc03e9401d2b08489cc487bf6a5e5b28ed9e6a9ac3c26068016b0bcd40e","site":null,"source":"https://github.com/NEU-SNS/wehe-android","license_or_tos":"Apache-2.0","resources":null,"verified":false}