{"appId":"net.moasdawiki.app","appShortcutName":"MoasdaWiki App","appDisplayName":"MoasdaWiki App","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Herbert Reiter/https://gitlab.com/moasdawiki/moasdawiki-app/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Privacy-Friendly Knowledge Management App\nMoasdaWiki App is a privacy-friendly frontend for the MoasdaWiki Server\nknowledge management tool. It mirrors the Wiki content on your mobile device.\n\n<b>Features:</b>\n\n- Synchronizes the content from your MoasdaWiki Server instance.\n- Fast full text search.\n- Calendar integration: Shows birthdays and events in the mobile calendar.\n- Data privacy by design: Directly connects to your server instance in your private network. No trackers, never establishes a cloud connection.\n\n<b>Synchronize content with a MoasdaWiki Server:</b>\n\n1. Download MoasdaWiki Server from https://moasdawiki.net/.\n2. Set up a MoasdaWiki Server instance in your LAN.\n3. Enable LAN access to the server: Edit the repository file config.txt and change the setting authentication.onlylocalhost = false. Restart the server afterwards.\n4. Install the MoasdaWiki App.\n5. In the app you can see a hint that it has to be configured first. Press on that hint.\n6. Press on \"Host name\" and enter the host name or IP address of the server instance, e.g. 192.168.1.101. Press OK.\n7. In the status section below you should see \"Needs authorization at server\". Otherwise check host name and port again.\n8. On server side open the Wiki page in a browser, click on \"Help\" and \"Synchronization\".\n9. You can see a list of devices and synchronization sessions. Check the device name and click on \"Grant\".\n10. Back in the app press the back button on the upper left corner to get back to the main dialog. Now you can see a hint that the app has to be synchronized. Press on that hint.\n11. Now you should have all the server content also in the app and you can see the \"Home-App\" wiki page.\n\nHint: Content cannot be modified within the app as it is no fun to type Wiki syntax on the mobile device, changes have to be done via the MoasdaWiki Server.\n","repo":{"author":"Herbert Reiter","repo":"https://gitlab.com/moasdawiki/moasdawiki-app"},"version":"bb760479f8b2d42a641ca01faf0ffa394bd5829cb23ea743dbe4944051952c68","site":null,"source":"https://gitlab.com/moasdawiki/moasdawiki-app","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}