{"appId":"net.ibbaa.keepitup","appShortcutName":"Keep it up","appDisplayName":"Keep it up","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Alwin Ibba/https://github.com/ibbaa/keepitup/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Simple network monitoring\nKeep it up checks network services periodically by sending a ping, connecting to a specific port or downloading a site. It can also be used to ensure a connection with a timeout will be kept alive.\n\n<b>Features</b>\n\n- Create multiple separate network tasks\n- One task monitors one network service at a specified interval\n- A task sends a specified number of pings, performs a specified number of connections attempts or downloads a file or a site\n- Successful and unsuccessful attempts are logged\n- Downloaded files can automatically be deleted after a successful download or be kept\n- Notifications can be sent on failure or when a network service goes down or up\n- A network task can be restricted to WiFi connections, i.e. it does not perform any action on mobile networks with potentially limited download data\n- The configuration can be exported and imported as a JSON data file\n- Intervals can be defined during which all background work is suspended for battery saving\n\n<b>Permissions</b>\n- <i>RECEIVE_BOOT_COMPLETED</i> for restarting running networks tasks on device boot\n- <i>ACCESS_NETWORK_STATE</i> for checking network accessibility\n- <i>INTERNET</i> for accessing the internet\n- <i>WAKE_LOCK</i> to keep the device awake while executing a task\n- <i>FOREGROUND_SERVICE</i> to start the foreground service for running tasks\n- <i>USE_EXACT_ALARM</i> to start networks tasks after expiry of intervals (Android 13+)\n- <i>SCHEDULE_EXACT_ALARM</i> to start networks tasks after expiry of intervals (Android 11 and 12)\n- <i>POST_NOTIFICATIONS</i> for sending notifications\n\n<b>Note</b>\nThe app works best if you disable battery optimization. If battery optimization is active, network tasks execution may be unreliable especially for short intervals, i.e. they may trigger less often and the trigger time may not be exact. There is a link in the app leading to the Android battery settings for the app. Of course, with disabled battery optimization power consumption may be higher.\n","repo":{"author":"Alwin Ibba","repo":"https://github.com/ibbaa/keepitup"},"version":"681ec16aa7a9d1ddb77782c871540ab911923d37ca8d8d6b58d43c7f60ad84ef","site":null,"source":"https://github.com/ibbaa/keepitup","license_or_tos":"Apache-2.0","resources":null,"verified":false}