{"appId":"net.ddns.mlsoftlaberge.trycorder","appShortcutName":"Trycorder","appDisplayName":"Trycorder","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Martin Laberge/https://github.com/mlsoft/Trycorder5/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":16,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Upgrade your mobile device to a full-fledged tricorder\nA Trycorder with sci-fi like looking and sensors, communication, remote-control\nbetween all trycorders on the planet through the use of a tryserver.\n\nWith this Trycorder, You can do the following:\n\n* Look, feel, and sound like the federation trycorder.\n* Fits in your pocket, so you can beam out on demand.\n* Scan your environment, temperature, pressure, light, magnetic, gravity, orientation,...\n* Control the device by voice-command. (Press top left, and say \"computer fire\" or \"computer beam me up\" for example)\n* Take pictures and recordings from your findings on new planets.\n* Remote control your own starship, fire, communications, shields, transporter, viewer, ... (You have to provide the starship, and make sure it is on the wifi router that you use).\n* Chat with other Trycorder users all around the planet.\n* Consult logs of operations. View the pictures and recordings you got back from your away mission.\n* View Magnetic, Orientation, Gravity, Temperature sensors values drawn in the sensor area.\n* View Phaser, Torpedo, Transporter operation in your sensor screen.\n* View Shields, Communication Waveform, Tractor Beam sensor animation on your sensor screen.\n* The application is usable in space, provided your phone is space-proof, and you wear a space-suit.\n* The application can be adapted easily for different starships remote protocols.\n* For captains only: Crew Information and Evaluation module. (to be found under logs/crew) (Contacts access)\n* And many more to come ...","repo":{"author":"Martin Laberge","repo":"https://github.com/mlsoft/Trycorder5"},"version":"46e0f85f912a37a03e2e0f03880fc27c18efb64148c27f77151f2fcf0052c3a3","site":null,"source":"https://github.com/mlsoft/Trycorder5","license_or_tos":"Apache-2.0","resources":null,"verified":false}