{"appId":"org.nsh07.wikireader","appShortcutName":"WikiReader","appDisplayName":"WikiReader","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Nishant Mishra/https://github.com/nsh07/WikiReader/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Read Wikipedia pages distraction-free\n<p>A lightweight Android app for reading Wikipedia articles distraction-free. Supports light mode, dark mode, Material You dynamic colors and 300+ Wikipedia languages, with a customisable simple interface</p>\n\n<p>Features</p>\n<ul>\n    <li><b>Fast loading:</b> The article text is loaded before anything else, so you can get to reading, quick</li>\n    <li><b>Feed:</b> Read the article of the day, find trending articles and get up to speed on the news with the Wikipedia Feed</li>\n    <li><b>Article image:</b> View an image of the topic from its Wikipedia page. Click on it to enlarge it and view in full-screen</li>\n    <li><b>Random article:</b> Feeling lucky? Click the random article button to read a random article</li>\n    <li><b>Choose your language: Choose from over 300 languages on Wikipedia</b></li>\n    <li><b>Save articles:</b> Download articles to your device for offline reading</li>\n    <li><b>One-handed use:</b> Use the floating action buttons at the bottom for a complete one-handed experience</li>\n    <li><b>Lightweight:</b> The app starts instantly, and works smoothly</li>\n    <li><b>Material Design 3:</b> Designed according to the latest Material Design 3 guidelines</li>\n    <li><b>Smooth animations:</b> Smooth and fluent animations</li>\n    <li><b>Customizable colors:</b> Choose from light/dark themes and customize the Material 3 color palette</li>\n    <li><b>Customizable font size:</b> Choose your own comfortable font size</li>\n    <li><b>Data saver:</b> Save your limited data plan by loading text only</li>\n    <li><b>Math expressions:</b> View properly rendered mathematical expressions for easily reading mathematical articles</li>\n</ul>\n","repo":{"author":"Nishant Mishra","repo":"https://github.com/nsh07/WikiReader"},"version":"3f4194c359461d5dd58beb742d6e668e9c790fdb21f9c854208b6fc3e071bb9b","site":null,"source":"https://github.com/nsh07/WikiReader","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}