{"appId":"org.asnelt.derandom","appShortcutName":"Derandom","appDisplayName":"Derandom","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Arno Onken/https://gitlab.com/asnelt/derandom/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Pseudo random number predictor\nPredicts pseudo random numbers based on a sequence of observed numbers.\n\nEnter a sequence of numbers that you obtained from a pseudo random number generator like, for instance, the Java standard pseudo random number generator or the Mersenne Twister MT19937.  The app will then try to predict following numbers from the generator.\n\nThe app expects all numbers to be entered as integers or floating point numbers between zero and one.  Currently, floating point numbers are supported for the Mersenne Twister only.  Three input modes are supported:\n1. <em>Text field</em> lets you enter the numbers directly on the device.\n2. <em>File</em> lets you choose a file with newline separated number strings.\n3. <em>Socket</em> opens a server socket on the device.  You can then connect with a custom client by means of a client socket and send newline separated number strings to the server.  After each number the server will send back the next newline separated predictions.  Each block of predictions is separated by an additional newline.\n\nTo test the app, enter the following numbers in the <em>Text field</em>:\n<code>\n1412437139\n1552322984\n168467398\n1111755060\n-928874005\n</code>\n\nThese numbers were sampled from the Java linear congruential generator <em>Random.nextInt()</em>.  Thus, the app should detect <em>LCG: Java</em> after the third number input, and numbers in the prediction history should appear in green instead of red, indicating that those numbers were correctly predicted.\n\nThe source code of this app is published on GitLab.  There you can also find a Python program for testing socket input: https://gitlab.com/asnelt/derandom/blob/HEAD/README.md\n","repo":{"author":"Arno Onken","repo":"https://gitlab.com/asnelt/derandom"},"version":"b92260322efc1ab9741cf1de17b7c56cda1c94f26175997c92c11e406584c492","site":null,"source":"https://gitlab.com/asnelt/derandom","license_or_tos":"Apache-2.0","resources":null,"verified":false}