{"appId":"org.avmedia.gshockGoogleSync","appShortcutName":"Casio G-Shock Smart Sync","appDisplayName":"Casio G-Shock Smart Sync","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Ivo Zivkov/https://github.com/izivkov/CasioGShockPhoneSync/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":26,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Add smart functions to your Casio square BT G-Shock Watch.\nCasio G-Shock Smart Sync\n\nWhat is it?\n-----------\nI think we can do better than the Official Casio G-Shock App!\nThis app provides the following extra features:\n\n- Sets watch's reminders from Google Calendar\n- Automatically sets correct timezone when travelling\n- Use your watch to trigger actions on your phone remotely\n- Allows you to set when auto-time adjustment will run\n- Auto-configure most watch settings from phone's configuration\n- Phone's alarms can be synced with watch's alarms\n- Super fast connection time: 3.5 seconds vs 12 seconds for the official app\n\nSupported Watches\n-----------------\nThe app will try to connect and adapt to any Casio watch that wants to connect to it (not just G-Shock). Here are some watches which are reported to work with the app:\n\n- G(M)W-5600\n- G(M)W-5000\n- GA-B2100\n- GA-B001-1AER\n- GST-B500\n- GST-B200\n- MSG-B100\n- G-B001\n- GBD-H1000 (Partial support)\n- MRG-B5000\n- GCW-B5000\n- GG-B100\n- Edifice ECB-30\n- ECB-10\n- ECB-20\n- Most Edifice watches\n- Most Protrek models\n- ABL-100WE\n\nGeneral\n-------\nThe app works by sending commands to the watch via Bluetooth (BLE). The watch data is not persisted on the phone but is read from the watch each time a connection is established. Any changes on the app are sent back to the watch only when the Send to Watch button is pressed.\n\nSetting Time\n------------\nThe local time can be set from the main screen by pressing the Send to Watch button next to the current time display. The app uses your current location to get the local time. You can then set the watch time accordingly, without having to change your World Time selection on the watch. This screen also shows your Home Time location and battery level.\n\nAlarms\n------\nThe B5600/B5000 watches have 5 alarms and a Signal or chime setting. They are first read from the watch and displayed in the app. The alarms can be updated by pressing on the time display of each alarm. A dialog will appear which allows you to select the time. Once the alarms have been set, you can send them to the watch or send them to the Alarm Clock app on the phone.\n\nEvents\n------\nThis screen displays events from your Google Calendar and allows you to send these events to your watch's reminders. Ensure that your phone is set to auto-sync with your Google Account. Without this setting, events added to your phone will not sync with your Google account and will not appear in the app.\n\nEvent Types and Compatibility\n-----------------------------\nGoogle Calendar supports various types of events:\n- One-time events: Single occurrences.\n- Repeating events: Daily, weekly, monthly, yearly, or complex patterns (e.g., \"every second Thursday of the month\").\n- Count events: Limited repetitions, such as \"repeat 12 times every Monday.\"\n\nWhile the app does its best to adapt calendar events to the watch, some limitations exist:\n- Not Supported: Daily events and complex patterns (e.g., \"every second Thursday of the month\").\n- Count Events: Simulated on the watch using a start and end date, adjusted to match the event's start time, frequency, and count.\n\nEvents that cannot be adapted will appear as Incompatible. Only future events and ongoing recurring events are displayed.\n\nWatch-Specific Behavior\n----------l-------------\nThe watch only supports all-day reminders. For Google Calendar events with a specific time, the app will convert them into all-day reminders on the watch while still retaining their date.\n\nActions\n-------\nThe selected actions are run when the user short-presses the lower-right watch button from disconnected mode (initial screen). Using these actions, the watch acts like a remote control for your phone.\n\nSettings\n--------\nThis screen allows you to set up the watch's settings. You can auto prefill the values using information from your phone.\n\nWhere are my World Cities?\n--------------------------\nUsing an app to manually swap between Home Time and World Time is a bit silly. Your phone already knows where you are. When setting time, this app will also","repo":{"author":"Ivo Zivkov","repo":"https://github.com/izivkov/CasioGShockPhoneSync"},"version":"05f45e21401f649f3f270478c856ec867a2b710d7fc6ff3e86619d8de803c445","site":null,"source":"https://github.com/izivkov/CasioGShockPhoneSync","license_or_tos":"MIT","resources":null,"verified":false}