{"appId":"org.calyxinstitute.vpn","appShortcutName":"Calyx VPN","appDisplayName":"Calyx VPN","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Calyx Institute/https://gitlab.com/CalyxOS/bitmask_android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Free VPN Service offered by The Calyx Institute\nWith CalyxVPN, you can safely encrypt all your network traffic and route it through the Calyx Institute.\n\n• Anonymous VPN: No user accounts and no logging.\n• Anonymous IP Address: When the VPN connection is active, all the servers on the internet will see you as originating from an anonymous IP hosted by Calyx.\n• Free: This is a free service provided by the Calyx Institute.\n• Open Source: Both the client and server are 100% free and open source software.\n• No IPv6 Leaks: CalyxVPN will not leak IPv6 traffic (requires root).\n• No DNS Leaks: CalyxVPN is configured on both the client and the server to prevent any leaking of DNS. All DNS requests are anonymously handled by Calyx when the VPN is on.\n• Circumvention: When \"Use Bridges\" option is enabled, all your traffic is hidden as normal web traffic, in order to circumvent some censorship systems that block VPN traffic.\n\nAs with all VPNs, CalyxVPN only adds security to your data as it flows over the network. It cannot protect the content of your data that is stored or that you give to a website. It also does not prevent advertising and tracking in your apps or web browser (except when this tracking is based on your IP address).\n","repo":{"author":"Calyx Institute","repo":"https://gitlab.com/CalyxOS/bitmask_android"},"version":"9f35d1e1e52c6402b4c0bd1ee7fe1a4e45454c30cf32c267e8e93f300743d790","site":null,"source":"https://gitlab.com/CalyxOS/bitmask_android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}