{"appId":"org.secuso.privacyfriendlynotes","appShortcutName":"Notes (PFA)","appDisplayName":"Notes (PFA)","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/SECUSO - Security Usability Society/https://github.com/SecUSo/privacy-friendly-notes/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"(SECUSO) Notes App with minimal permissions and without advertising\nPrivacy Friendly Notes allows you to take and manage notes on Android devices. It belongs to the Privacy Friendly Apps group developed by the research group SECUSO at Karlsruhe Institute of Technology. More information can be found an secuso.org/pfa\n\nThe following four types of notes are available:\n1. Simple text notes\n2. Checklist notes\n3. Audio notes\n4. Sketchnotes\n\nFurthermore, the notes can be grouped into categories, reminders can be assigned to notes and the notes can be exported to the device storage.\n\nHow does Privacy Friendly Notes from other similar apps?\n\n1. Minimal Permissions\nThe permission \"RECORD_AUDIO\" (Category \"Mikrofon\") is required to record audio notes. In case this permission is not granted by the user (in Android versions higher than 6) it will not be possible to record audio notes.\n\n\"WRITE_EXTERNAL_STORAGE\" (Category \"Speicher\") is used to export notes to the device storage. In case this permission is not granted by the user (in Android versions higher than 6) it will not be possible to export notes.\n\nBeside the permissions above the permission “RECEIVE_BOOT_COMPLETED” (Category “Normal/non-critical”) is required to reschedule notifications after a reboot. This permission cannot be modified by the user.\n\nFor comparison: The Top Ten of similar apps from the Google Play Store , die im Google Play Store requires an average of 11,7 permissions (in December 2016). These are for instance the location permission or the permissions to access, modify or delete storage.\n\n2. No advertisement\nMoreover, Privacy Friendly Notes distinguishes from many other applications in the way that it completely relinquishes advertisements. Advertisement might track a user's actions. It could also shorten battery life or use mobile data.\n\nYou can reach us via\nTwitter - @SECUSOResearch https://twitter.com/secusoresearch\nMastodon - @SECUSO_Research@bawü.social https://xn--baw-joa.social/@SECUSO_Research/\nJob opening - https://secuso.aifb.kit.edu/english/Job_Offers_1557.php\n","repo":{"author":"SECUSO - Security Usability Society","repo":"https://github.com/SecUSo/privacy-friendly-notes"},"version":"7e63302b3c0346117661899c10871e6e122c63fde49a9197165ee3f743fb75b8","site":null,"source":"https://github.com/SecUSo/privacy-friendly-notes","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}