{"appId":"org.jfet.batsHIIT","appShortcutName":"Bats! HIIT","appDisplayName":"Bats! HIIT","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Riad S. Wahby/https://github.com/kwantam/batsHIIT/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":8,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Practice high intensity interval training\nBats! HIIT is a simple but useful High Intensity Interval Training timer.\n\n<b>Workout structure</b>\n\nA HIIT workout with Bats! HIIT comprises a sequence of alternating rest (warm\nup/cool down) intervals and work blocks. For example, a workout with two workout\nblocks will look like\n\n1) warm up 2) block #1 3) rest 4) block #2 5)cool down\n\nBats! HIIT always inserts rest intervals between blocks, and always includes a\nwarm up and cool down interval.\n\nThe length of the rest interval is configurable. By default, it is 60 seconds.\n\n<b>Block structure</b>\n\nA block is a series of work/break interval pairs; each work interval has a\ncorresponding break interval. For example, you might configure Bats! HIIT to\ninclude 4 work intervals per block, with a 50 second work interval and 10 second\nbreak. Such a block would take 4 minutes.\n\n<b>Audio and visual cues</b>\n\nBats! HIIT always gives a warning consisting of 4 short chirps when you're about\nto transition to a new interval. Every work interval begins with a single\nhigh-pitched beep; break intervals begin with a descending, two-tone beep. Rest\nintervals do not have an initial beep.\n\nDuring work intervals, your phone's screen will be green. In breaks, the screen\nwill turn yellow. Rest is indicated by a red background. Your phone will also\ntell you how long is left in the present sub-interval and how many work/break\npairs and blocks remain.\n\n<b>Screen lock</b>\n\nWhen you're exercising, you want to be able to see your progress without\nunlocking your screen. Bats! HIIT prevents your screen from turning off, though\nit does allow it to dim for power savings. This lets you know at a glance how\nyou're doing. Save/recall workout\n\nYou can save/recall/delete stored workouts. \"Last workout\" is automatically\ncreated whenever you do a workout, and is restored when the app is next started.\n\n<b>Pause workout</b>\n\nIf Bats! HIIT loses focus during a workout, your workout will be paused and will\nresume when Bats! HIIT resumes. Delay locked loop\n\nTo ensure that your workout is accurately timed, Bats! HIIT implements a\nfeedback system called a delay-locked loop. Every second, when Bats! HIIT wakes\nup to update the timer readout, it measures how long it was actually asleep and\nadjusts future delay intervals to hit the target 1-second sleep interval. In\npractice, this reduces short-term timing errors from more than 5% to about 0.2%;\nsince the error is integrated over the life of your workout, the overall\naccuracy is two to three orders of magnitude better than the short-term errors.","repo":{"author":"Riad S. Wahby","repo":"https://github.com/kwantam/batsHIIT"},"version":"38220e6f60d205e53343820202bbf928d8bbc9a92172acef7930653a35cdafd3","site":null,"source":"https://github.com/kwantam/batsHIIT","license_or_tos":"MIT","resources":null,"verified":false}