{"appId":"org.openttd.fdroid","appShortcutName":"OpenTTD","appDisplayName":"OpenTTD","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/n-ice-community/commandergenius/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A simulation game based on the popular game \"Transport Tycoon Deluxe\"\nNOTE: This is a fork of https://github.com/pelya/openttd-android since development there is on hold currently.\n\nOpenTTD is an open source reimplementation of the Microprose game Transport Tycoon Deluxe (TTD). As president of a start-up transportation company in (typically) 1950, you have a choice of building rail, road, air and maritime transportation routes to build up your transportation empire. Outsmart your competition by beating them to attractive passenger and commodities routes to become the game's highest-ranking transport company by the year 2050.\n\nOpenTTD is based on Chris Sawyer's Transport Tycoon Deluxe and introduces a whole set of new features, including multiplayer support, better stations and vehicles, larger maps and a host of other options. \n\nPosting a full list of features would be futile as it would mean updating this page almost daily, and even then some things might be forgotten. Play with the game to experience all the features yourself, or take a look at the <a href=\"https://wiki.openttd.org/en/Manual/\">Manual</a> for a more thorough listing and explanation of the features and possibilities available.\n\nTips:\n* Scroll the map with two fingers, when you are building roads or stations.\n* Close dialogs by dragging them to the screen edge.\n","repo":{"author":"Unknown","repo":"https://github.com/n-ice-community/commandergenius"},"version":"355cc302a892fa8c62459b6ae6d0f2940868b9fea5221f784f36f90677b34610","site":null,"source":"https://github.com/n-ice-community/commandergenius","license_or_tos":"LGPL-2.1-or-later","resources":null,"verified":false}