{"appId":"org.y20k.escapepod","appShortcutName":"Escapepod - Podcast Player","appDisplayName":"Escapepod - Podcast Player","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://codeberg.org/y20k/escapepod/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Escapepod is a simple and lightweight app for listening to podcasts.\nEscapepod is a straightforward and lightweight app that takes a minimalistic approach to podcast listening, which may not appeal to everyone. The app consists of only two screens: a list of all podcasts and a list of episodes for a single podcast. Escapepod lacks a podcast discovery feature, offering only a simple search option. Additionally, it opens RSS podcast links when tapped in a web browser.\n\n\nFREQUENT QUESTIONS\n\nDOES ESCAPEPOD HAVE PLAYBACK QUEUE?\nEscapepod has a simple up-next feature. Tap play on an episode while listening to another one. You will be be given the opportunity add it to the up-next slot.\n\nWHAT ARE THE DEFAULT SETTINGS?\n- Auto-update does not download files over cellular network\n- Escapepod by default only keeps two episodes\n\nCAN ESCAPEPOD KEEPS MORE THAN TWO EPISODES?\nEscapepod tries to reduce the number of episodes it keeps. Here are the rules for that:\n- Escapepod keeps the latest two episodes\n- Episodes, that have been started, or that have been downloaded manually, are kept, too\n- Episodes that have not been listened to in more than two weeks are removed.\n\nDOES ESCAPEPOD SUPPORT OPML?\nYou can import a podcast list using the OPML exchange format using the respective option in the app's Settings. The current podcast collection can be exported via Settings, too. Additionally Escapepod keeps an up-to-date OPML file in the folder /Android/data/org.y20k.escapepod/files/collection/.\n\nWHERE DO THE PODCAST SEARCH RESULTS COME FROM?\nEscapepod searches by default the Podcastindex.org (https://podcastindex.org/) online database - or if you toggle the respective setting the gpodder.net (https://gpodder.net/directory/) online database.\n","repo":{"author":"Unknown","repo":"https://codeberg.org/y20k/escapepod"},"version":"d6e5a5a33c69e017d256fd603e02aa5e0f02012bb88ef0f3911ce2862b91a122","site":null,"source":"https://codeberg.org/y20k/escapepod","license_or_tos":"MIT","resources":null,"verified":false}