{"appId":"org.isoron.uhabits","appShortcutName":"Loop Habit Tracker","appDisplayName":"Loop Habit Tracker","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Alinson Xavier/https://github.com/iSoron/uhabits/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":28,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Track your habits and long-term goals\nLoop is a simple app that helps you create and maintain good habits, allowing\nyou to achieve your long-term goals. Detailed graphs and statistics show you how\nyour habits improved over time.\n\nFeatures\n\n* Simple, beautiful and modern interface: Loop has a minimalistic interface that is easy to use and follows the material design guidelines.\n* Habit score: In addition to showing your current streak, Loop has an advanced algorithm for calculating the strength of your habits. Every repetition makes your habit stronger, and every missed day makes it weaker. A few missed days after a long streak, however, will not completely destroy your entire progress.\n* Detailed graphs and statistics: Clearly see how your habits improved over time with beautiful and detailed graphs. Scroll back to see the complete history of your habits.\n* Flexible schedules: Supports both daily habits and habits with more complex schedules, such as 3 times every week; one time every other week; or every other day.\n* Reminders: Create an individual reminder for each habit, at a chosen hour of the day. Easily check, dismiss or snooze your habit directly from the notification, without opening the app.\n\n<a href=\"https://github.com/iSoron/uhabits/blob/HEAD/README.md#screenshots\">Screenshots</a>","repo":{"author":"Alinson Xavier","repo":"https://github.com/iSoron/uhabits"},"version":"5c4d90475e9bf2ad8ac07acf305d75ed30a6d05b1e596a37300157ccb46e9be4","site":null,"source":"https://github.com/iSoron/uhabits","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}