{"appId":"org.stingle.photos","appShortcutName":"Stingle Photos","appDisplayName":"Stingle Photos","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/stingle/stingle-photos-android/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Stingle Photos is a secure, end-to-end encrypted gallery and sync app\nStingle Photos is a secure, open-source photo, video cloud storage and backup application that is safe, ad-free and easy to use. It provides strong encryption and privacy to keep you safe from data breaches and leaks. Easily sync and backup and share your photos and videos on our secure cloud storage.\n\nWhy use Stingle Photos safe cloud storage app?\n\nSuccessor of wildly popular SafeCamera application, Stingle Photos is an open-source, secure, end-to-end encrypted media backup application with the state-of-the-art security technologies that ensure your privacy.\n\n* We put our users first by prioritizing your privacy \n* All your photos & videos are secured with end-to-end encryption\n* Unlike other companies, we only store the bare minimum of metadata on our servers: your email, registration date, payment plan, number of active devices, number and size of encrypted files\n* We don’t collect big data or track our users in any way\n* No need to fear for your data privacy - ONLY you can have access to your photos & videos\n\nKey features\n\n* Full on the fly encryption of video support: recording and playback\n* Fingerprint and face id support for fast unlocking\n* Ability to take photos & videos without entering a password or providing a fingerprint. \n* Backup and sync functionality. All your photos & videos are backed up in the background to the cloud and synced to other devices using the same account\n* Albums for better library organization\n* Secure sharing. You can share photos and videos with friends and family with strong end-to-end encryption.\n* As anonymous as possible. Registration just takes an email and password to start using the app\n* Stingle Photos is 100% free and open-source. It includes 1GB free cloud storage space. You only pay if you need more cloud storage. No ads or third-party libraries like that can track you.\n* We as a provider can’t see anything in your account. If the servers ever get hacked or law enforcement agencies request access to your data, they won’t get anything valuable. \n\nIf you have any questions or suggestions, drop us a message at support@stingle.org","repo":{"author":"Unknown","repo":"https://github.com/stingle/stingle-photos-android"},"version":"8034360f4a12e495aa61969ddcc7acba62b0260eac44de907c80b87523829451","site":null,"source":"https://github.com/stingle/stingle-photos-android","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}