{"appId":"org.opensurge2d.surgeengine","appShortcutName":"Open Surge: retro game engine","appDisplayName":"Open Surge: retro game engine","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/alemart/https://github.com/alemart/opensurge/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7"]}},"displayImages":[],"description":"A retro game engine with a fun platformer inspired by 16-bit Sonic games.\n<b>Make your dreams come true!</b> Open Surge Engine is an open-source 2D retro game engine for creating games and making your dreams come true!\n\n<b>It's a ton of fun!</b> Surge the Rabbit is a featured jump 'n' run created with the Open Surge Engine. It's made in the spirit of classic 16-bit Sonic platformers of the 1990s. Play as Surge in fun and exciting levels filled with challenges!\n\n<b>Unleash your creativity!</b> Create your own amazing games and play them on your PC and on your mobile device! Share your games with your friends! It's limitless fun!\n\n<b>A powerful engine for retro games!</b> One of the core elements of the engine is SurgeScript, a scripting language for games. Use it to create new gameplay mechanics, characters with special abilities, bosses, and much more! The sky is the limit!\n\nOpen Surge Engine is an amazing tool for learning game development, programming, digital art, and the nature of free and open-source software in a playful way.\n\nNote: it's recommended to use a PC to create your games. You can play them on PCs and on mobile devices. Android TV users need a gamepad to play and a mouse to use the level editor.\n\nOfficial website: http://opensurge2d.org\n","repo":{"author":"alemart","repo":"https://github.com/alemart/opensurge"},"version":"89f597b0625582c7deabe44852c2924069eb75d4fb5999a8070ae9844be3b9b5","site":null,"source":"https://github.com/alemart/opensurge","license_or_tos":"GPL-3.0-or-later","resources":null,"verified":false}