{"appId":"org.staacks.alpharemote","appShortcutName":"α-Remote","appDisplayName":"α-Remote","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/DiCon / Sebastian Staacks/https://github.com/Staacks/alpharemote/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":31,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Bluetooth remote for Sony Alpha Cameras\nA Bluetooth remote control app for Sony Alpha cameras that is immediately available in your phone's notification area as soon as you turn on your camera. This app is free and open source.\n\nThe app uses Android's companion app feature, meaning that it does not actively scan for your camera, but is only started by Android when the camera has been seen by the system - and the app's service is shut down as soon as it is turned off again. The remote control buttons are there when you need them, but no resources or screenspace are used otherwise.\n\nSo far, this app has only been tested with the following cameras:\nILCE-6400 (α6400), ILCE-6700 (α6700), ILCE-7M3 (α7 III), ILCE-7CM2 (α7C II), ILCE-7M4 (α7 IV), ILCE-7RM3 (α7R III), ILCE-9 (α9), ZV-E10\n\nIt is expected to work with any Sony camera that supports Bluetooth remotes, including the following models:\nDSC-RX100M7, DSC-RX100M7G, ZV-1, ILCE-7M4K, ILCE-7RM4A, ZV-E10, ZV-E10L, ILCE-1, ILCE-7C, ILCE-7CL, ILCE-7SM3, ILCE-9M2, ILCE-6100, ILCE-6100L ,ILCE-6100Y ,ILCE-6600, ILCE-6600M, ILCE-7RM4, ILCE-6400L, ILCE-6400M, ILCE-7M3, ILCE-7M3K, ILCE-7RM3, ILCE-9\n\nIf you have one of those cameras, I would be happy to get feedback on how well it works with this app.\n\n","repo":{"author":"DiCon / Sebastian Staacks","repo":"https://github.com/Staacks/alpharemote"},"version":"34ae89fc3eb41d9b7d006f40a34ded8c87cbec4604b93fb5f436b676ab20a44c","site":null,"source":"https://github.com/Staacks/alpharemote","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}