{"appId":"org.studip.unofficial_app","appShortcutName":"unofficial Stud.IP-app","appDisplayName":"unofficial Stud.IP-app","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Tarek Sander/https://github.com/tareksander/Stud.IP-App/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"An unofficial app for Stud.IP systems.\nThe API of the system has to be enabled to use this app.\n\nYou can read system-wide news, view your courses, course news, course forums, post on forums,\nread and write messages, view, download and upload your files and course files.\nYou can also view Opencast videos, browse Courseware and join BigBlueButton meetings.\nWith the document provider you can access your Stud.IP files like all other files on your device.\nYou can use the mobile browser version of Stud.IP in the app, with support for autofilling your username and password.\n\nIf your Stud.IP server supports OAuth for this app, you don't even have to trust it with your login data, you can simply log in to Stud.IP and give the app access.\n\nYou can enable the notification service to get your Stud.IP notifications as notifications on the device.\n\n\nFor Help: Settings->view help\n\n\nPermission description:\n<ul>\n<li>View network connections: Used to not download pictures when mobile data is used, to preserve mobile data volume.</li>\n<li>Full network access: An internet connection is required to communicate with the Stud.IP-Server.</li>\n<li>Modify contents of shared storage: Is requested at runtime when you download files.\nIs needed to save the files to the downloads directory.\nNot used anymore for Android 10 or later.</li>\n<li>Record audio, change audio settings, use camera, prevent phone from sleeping: Used for the BigBlueButton video conferences.</li>\n<li>foreground services, start at boot: used for the Notification service.</li>\n</ul>","repo":{"author":"Tarek Sander","repo":"https://github.com/tareksander/Stud.IP-App"},"version":"b9dac25f375a8b2aa934f461cf8dcebd36d5db60ac8f25163d805fec4e2a3c32","site":null,"source":"https://github.com/tareksander/Stud.IP-App","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}