{"appId":"org.fossify.notes","appShortcutName":"Fossify Notes Beta","appDisplayName":"Fossify Notes Beta","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Fossify/https://github.com/FossifyOrg/Notes/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":23,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"To do list widget with a notebook organizer, checklist, simple shopping list\nIntroducing Fossify Notes – your ultimate tool for effortless note-taking, organization, and planning. Simplify your life with this intuitive organizer designed to streamline your tasks and ideas effortlessly.\n\n🗒️ SIMPLE NOTE-TAKING:\nFossify Notes lets you quickly jot down shopping lists, address reminders, or brilliant startup ideas with just a tap. Say goodbye to clutter and hello to efficient note creation. No more fussing over complex setups.\n\n📋 REMARKABLE ORGANIZATION:\nStay on top of your duties with ease using Fossify Notes' simple-to-use organizer and colorful note-taking widget. Never forget crucial information or shopping lists again – it's all at your fingertips.\n\n💾 AUTOMATIC SAVING:\nForget about losing your work. Fossify Notes automatically saves your edits, ensuring that your changes are always preserved. Create multiple independent notes and lists effortlessly.\n\n🖼️ CUSTOMIZABLE WIDGET:\nAccess your lists and manage your to-do tasks in a flash with Fossify Notes' customizable widget. Enjoy seamless organization on the go with just a tap.\n\n🚫 AD-FREE AND PRIVACY-FOCUSED:\nEnjoy a clutter-free experience with Fossify Notes – no ads or unnecessary permissions. Fossify Notes operates offline without internet permission ensuring a stable and secure environment for your notes.\n\n🔓 OPEN-SOURCE FREEDOM:\nFossify Notes is fully open-source, offering customizable colors and providing transparency and flexibility for users. Experience the freedom of customization and peace of mind with a community-driven note-taking solution.\n\nExperience the simplicity and efficiency of note-taking with Fossify Notes. Download now and unlock the power of organized thinking.\n\nExplore more Fossify apps: https://www.fossify.org\nOpen-Source Code: https://www.github.com/FossifyOrg\nJoin the community on Reddit: https://www.reddit.com/r/Fossify\nConnect on Telegram: https://t.me/Fossify\n","repo":{"author":"Fossify","repo":"https://github.com/FossifyOrg/Notes"},"version":"e999d530a4739e48f6c875cd9e0ca5cc5fd34aa70472d64310e06828a9dc9c63","site":null,"source":"https://github.com/FossifyOrg/Notes","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}