{"appId":"org.forkgram.messenger","appShortcutName":"Forkgram","appDisplayName":"Forkgram","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/Forkgram/TelegramAndroid/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64"]}},"displayImages":[],"description":"Forkgram is a fork of the official Telegram for Android application.\nForkgram is a simple fork of the Telegram Messenger with a few minor improvements.\n\nFeatures\n    Square avatars (sorry, I love it)\n    \"Delete for everyone\" enabled by default\n    Online colored statuses\n    Date of forwarded messages\n    Set rear camera as default for Video Messages\n    Buttons for backward and forward steps in audio player\n    Days of week to schedule time picker\n    A lot of self-destruct timer's options in secret chats\n    Send Video Messages without white background\n    \"Sync Contacts\" is disabled by default in Login activity\n    Send GIF with pre-written caption in Message Field\n    Send pre-written text from Message Field before sending sticker\n    See count of unread messages when selecting multiple dialogs\n\nAbilities:\n    Open archive on pulldown\n    See profile info from dialogs list via context menu\n    Select all messages between 2 selections from bar\n    Hide title and avatar in dialogs\n    Open calendar from long click on floating date\n    Jump to the first message in any dialog\n    Copy ID of dialogs\n    Open Saved Messages on long click on search top button\n    Delete all your messages in group\n    Attach text to Voice Message before sending it\n    Seek Voice Messages from audio player alert\n    Set custom title of main view\n    Copy links without protocol\n    Mention users by name\n    Copy Username without long touch\n    Copy URL from inline button\n\nOptions:\n    Turn off sync pins to make unlimited number of pinned dialogs\n    Raise all unmuted messages above muted messages\n    Disable Global Search\n    Hide \"Send As\" button\n    Disable thumbs in dialog list\n    Disable premium features\n    Hide animated locked premium emoji from emoji panel\n    Disable quick reaction with double tap\n    Show notifications content when application is locked\n    Enable time format with seconds for messages\n    Disable flip through photos by tapping on their edge\n    Disable sending sticker info in photos\n    Disable parameters from bot links\n\nFast Forward:\n    You can forward any message with Share Alert from Fast Forward menu item.\n    Share Alert now has two additional buttons: forward as copy (Anon Button) and forward without original caption (No-Text Button).\n    If you have pre-written comment, then No-Text Button will replace the original caption with your text.\n    A long press on both the Anon and No-Text buttons will send the message without sound\n    If a selected chat has Drafted Reply, then both Anon and No-Text buttons will send message to this Reply.\n\n    Selected messages can now be forwarded as grouped media.\n\n    Media within webpage previews now can be forwarded as plain media to any chat. Just open the webpage preview and tap the Anon Button from the top.\n","repo":{"author":"Unknown","repo":"https://github.com/Forkgram/TelegramAndroid"},"version":"aecdcb3c29b243e4d055a2d7ff5da2a5d0da13732ce82a5e52a700fa66d9a252","site":null,"source":"https://github.com/Forkgram/TelegramAndroid","license_or_tos":"GPL-2.0-or-later","resources":null,"verified":false}