{"appId":"rocks.poopjournal.morse","appShortcutName":"Morse","appDisplayName":"Morse","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Crazy Marvin & Contributors/https://github.com/Crazy-Marvin/Morse/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":19,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Translate text to Morse code or vice versa in real time\nDecipher Morse code to text or text to Morse code\n\nTurn any text into Morse code, or translate Morse code to text and hear the results.\n\n•\tClean, modern app design and interface.\n•\tMade to be simple to use for everyone.\n•\tRealtime translation: type in the word or code and have it translated immediately.\n•\tDecode from Morse to text, or text to Morse.\n•\tPress the speaker button to hear the code.\n•\tCopy the text by pressing the \"Copy\" button.\n•\tType in dot and dash using our built-in Morse keyboard. \n•\tLibre software (https://github.com/Crazy-Marvin/Morse)\n+\tMore features planned.\n\nDon’t let the special characters or dots and dashes befuddle you.\n\nMorse code is a system to encode letters and numbers to dash and dot signs.\nThe duration of the dash is three times the duration of a dot.\nEach dot or dash is followed by period of signal absence, called a space, equal to the dot duration.\n\nMorse code was first used for communicating via telegraph.\nThe most well-known Morse code is SOS, which is used to signal an emergency.\nAside from typing dots and dashed, you can also signal Morse code by turning light on and off, sounding a horn or tapping, etc.\nAll means of transmitting Mores code require the recipient understands it.\nIf not, our cipher tool can be used to find out the password, secret number, or any info you want to relay. \nSince people rarely communicate via telegraph, or learn it in the military, very few people have Morse codes memorized.\nInstead, it has become a way to encode something for special purposes.\nIt’s a useful language to know even if you just want to learn cryptography or solve cryptograms for fun.\n\n1.\tTell others when you are in a dangerous situation (SOS).\n2.\tHide your secret number or password via dots and dashes.\n3.\tCipher or decipher hidden clues in games.\n4.\tLearn cryptography or cryptogram through learning Morse codes.\n5.\tBecome a codebreaker by breaking secret codes in real time translation.\n6.  Create a secret number.\n+   Many more \n\n---\nIt really helps to leave a review or to star the project in the source code repsitory, and it means the world to us.\nIf you have problems using the app, please write an e-mail or open an issue on GitHub.\nResponses are most often immediate, and bugs are fixed as soon as possible. \n","repo":{"author":"Crazy Marvin & Contributors","repo":"https://github.com/Crazy-Marvin/Morse"},"version":"a703be04bce5e51a9d54946c4337605579c9dda699cf0ee085620c58c4890276","site":null,"source":"https://github.com/Crazy-Marvin/Morse","license_or_tos":"Apache-2.0","resources":null,"verified":false}