{"appId":"sh.fhs.ksre","appShortcutName":"Katawa Shoujo: Re-Engineered","appDisplayName":"Katawa Shoujo: Re-Engineered","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Fleeting Heartbeat Studios/https://codeberg.org/fhs/katawa-shoujo-re-engineered/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64"]}},"displayImages":[],"description":"(18+) A fan-made modernization of the classic visual novel\nKatawa Shoujo is a bishoujo-style visual novel set in the fictional Yamaku High School for disabled children, located somewhere in modern Japan. Hisao Nakai, a normal boy living a normal life, has his life turned upside down when a congenital heart defect forces him to move to a new school after a long hospitalization. Despite his difficulties, Hisao is able to find friends—and perhaps love, if he plays his cards right. There are five main paths corresponding to the 5 main female characters, each path following the storyline pertaining to that character.\n\nThe story is told through the perspective of the main character, using a first person narrative. The game uses a traditional text and sprite-based visual novel model with an ADV text box.\n\nThis version is a full remaster of the original VN, featuring upscaled images and a suite of accessibility features for the vision and hearing impaired. All fully free, open source, and community maintained. Forever.\n\nSummary of new features:\n* Upscaled images for modern displays\n* Russian, Deutsch, French, and Spanish translations builtin\n* Parallax mode\n* 2 Dyslexic modes\n* High contrast text\n* Self-voicing for custom fan voice-overs\n* Modding support\n* Updated engine and other under the hood technical improvements\n\nSee the project site at fhs.sh for more detilas\n","repo":{"author":"Fleeting Heartbeat Studios","repo":"https://codeberg.org/fhs/katawa-shoujo-re-engineered"},"version":"1a31fc5de78940f4422c3d66e00774043c9a52d5f09fadde1b2b8ed2bf0f1e9c","site":null,"source":"https://codeberg.org/fhs/katawa-shoujo-re-engineered","license_or_tos":"MPL-2.0","resources":null,"verified":false}