{"appId":"site.leos.apps.lespas","appShortcutName":"Les Pas - Photo Album for Nextcloud","appDisplayName":"Les Pas - Photo Album for Nextcloud","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/scubajeff/lespas/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":25,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A photo album that saves all your precious memory in your private cloud\nLes Pas, is a free, modern, lightweight and fast gallery app. Organize your photos, GIFs and videos into albums for easy viewing and sharing. With built-in two-way sync with your Nextcloud server, your files are kept private, secure and safe.\n\nManaging, Syncing and Archiving\n  * Organize your media files in albums\n  * Easy media importing by simply sharing files to Les Pas\n  * Manage media files in your phone's gallery and auto backup to server, each media folder in your phone has it's own backup setting\n  * Integrate with Snapseed for photo editing\n  * Support adding caption to photo\n  * Synchronization works with Nextcloud server and among multiple devices, edit albums on Nextcloud server and on all your mobile devices simultaneously\n  * Support Remote Album, which have all it's media file stored in Nextcloud server only, free up Phone's storage\n  * Search for photos by objects with AI\n  * Search photos by location\n  * Support GPX importing, so that you can easily add GPS location data to pictures shoot on your digital camera\n  * Support Nextcloud's external storage\n  * Beautiful theme inspired by works of Wes Anderson\n  * Support standard media format plus RAW and HDR photos\n\nSharing\n  * Share albums and album slideshow with other Nextcloud users, groups and circles\n  * Unique 'Joint Album' feature, which you and other Nextcloud users can edit together\n  * Export GPX file from album, you can share your adventure with others\n\nPrivacy focus\n  * Media files and thumbnails are all saved in App's private storage, stop being scanned by malicious apps\n  * Option provided to strip photo's EXIF before sharing to other social networks\n  * Option to hide album both in Phone and on server\n  * Authenticate on your Nextcloud server with your Nextcloud's credential\n  * Opensource\n\nAny apps that can do the above is merely a media file manager with a fancy UI. Les Pas does not stop here, it strives to provide ways of utilizing your photos. The past shouldn't be resting in the hard-drive, make all those memories shine.\n  *  Integrate with Muzei Live Wallpaper app, deliver 'Today in History' pictures right on your phone's desktop\n  *  Album slideshow, with background music\n  *  Unique 'Slideshow on Map' feature which runs album slideshow on Map\n  *  Support photo blogging in three ready made templates. With selected pictures and caption you added, you can share your stories with the world.\n\nThis project build using the following open source software:\n- OkHttp https://square.github.io/okhttp\n- PhotoView https://github.com/chrisbanes/PhotoView\n- osmdroid https://github.com/osmdroid/osmdroid\n- Android Open Source Project https://source.android.com\n- TensorFlow https://www.tensorflow.org\n- OpenStreetMap https://www.openstreetmap.org","repo":{"author":"Unknown","repo":"https://github.com/scubajeff/lespas"},"version":"64f3a9b3d1690a1ed4769138fdee2aa5bb11f5de4e84461bf865d67d5ba87fa9","site":null,"source":"https://github.com/scubajeff/lespas","license_or_tos":"Apache-2.0","resources":null,"verified":false}