{"appId":"top.donmor.tiddloid","appShortcutName":"Tiddloid","appDisplayName":"Tiddloid","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/donmor/https://github.com/donmor/Tiddloid/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Tiddloid is an app to work with locally stored TiddlyWikis.\nTiddloid Lite, a lightweight version of Tiddloid, is an app to work with locally stored TiddlyWikis. Once have some ideas, you can immediately write them down and save it in a tiddler, and sync the Wiki to your other devices so that you can access these ideas anywhere. See https://tiddlywiki.com/ for more details of TiddlyWiki.\nFeatures\n- Creating new TiddlyWiki files with latest template\n- Importing existing TiddlyWiki files stored on a writable source\n- Adding a folder containing TiddlyWiki-based `index.htm(l)` (Android 5.0 and above)\n- Receiving a TiddlyWiki site URL shared from Browser and save as a new file or a bookmark\n- Opening an HTML file and adding to the list if it is a valid TiddlyWiki\n- Applying theme color to the UI with some in-wiki configurations, as well as other tweaks\n- Saving changes by clicking the Save button\n- Save and Find option in context menu\n- Draft from any selected text\n- A Backup system that preserves your previous versions in case of misoperations\n- Convenient operations like Create shortcut, Clone and Delete\n- Importing or exporting wiki list data\nLicense\n  This app is under GPL v2 license. License files provided along with the source code (including licence files of dependencies).\nLocalization\n  The localization of this app is currently provided by Google Translation. Pull requests are welcomed if you have better translations.\nFor more details about this app, please visit the project page ( https://github.com/donmor/Tiddloid/ ) or my homepage ( https://donmor.top/ ).","repo":{"author":"donmor","repo":"https://github.com/donmor/Tiddloid"},"version":"a14a988fe8116231074d11e07b9a56c31ebe8259425948d91e9db2ca77ee5b42","site":null,"source":"https://github.com/donmor/Tiddloid","license_or_tos":"GPL-2.0-only","resources":null,"verified":false}