{"appId":"ua.com.radiokot.photoprism","appShortcutName":"Gallery for PhotoPrism","appDisplayName":"Gallery for PhotoPrism","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Unknown/https://github.com/Radiokot/photoprism-android-client/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":21,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"A convenient gallery for PhotoPrism with plenty of useful features\nThis app brings a convenient mobile gallery experience for PhotoPrism.\nIt does not support all the official web app functionality, but nevertheless has plenty of useful features:\n- Sending photos and videos to Gmail, Telegram or any other app\n- Grouping the content by days and months\n- Timeline scroll that lets you quickly jump to a specific month\n- Configurable search\n- Search bookmarks that let you save search configurations and apply them later\n- Enhanced live photo viewer, which works best with Samsung and Apple shots\n- Full-screen slideshow with configurable speed and video autoplay\n- Deleting items without archiving them first\n- Importing photos and videos trough sharing\n- Endless session without the need to re-enter the password\n- Connection to both private and public libraries\n- Support of mTLS (mutual TLS), HTTP basic auth and SSO like Authelia, Cloudflare Access, etc.\n- TV compatibility to easily browse your library with a remote-control (Search is only available with a mouse for now)\n- ⭐ Extensions:\n  - Memories – get a daily collection of photos and videos from the same day in past years\n  - Photo frame widget – see random photos from your library on the home screen\n\nThe gallery runs on Android 5.0+ and it is confirmed to work the PhotoPrism release of March 21, 2025.\nCompatibility with older PhotoPrism versions may be partial.\n\nThis is a free open-source app under the GPLv3 license: https://github.com/Radiokot/photoprism-android-client\n","repo":{"author":"Unknown","repo":"https://github.com/Radiokot/photoprism-android-client"},"version":"3ab09ec0d2b66549c2dc6094dfa78e6f9df13f5022fe161defa05b2f587ca613","site":null,"source":"https://github.com/Radiokot/photoprism-android-client","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}