{"appId":"v4lpt.vpt.i018.vpc","appShortcutName":"Valentin's PowerTools #018 - Volume Percent Calcul","appDisplayName":"Valentin's PowerTools #018 - Volume Percent Calcul","authorId":"fdroid","releaseTagName":"","downloadUrls":{"1":{"installerType":"AndroidApkZip","asset":"","url":"https://github.com/Valentin/https://github.com/v4lpt/VPC/releases/download//"}},"install":{"win32":null,"winarm":null,"linux":null,"linuxArm64":null,"linuxArm7":null,"android":{"assetId":1,"min_sdk":24,"abi":["Aarch64","Armv7","X86","X64"]}},"displayImages":[],"description":"Calculate alcohol mass, content and volume in drinks.\nVPT#018-VPC is an android app that swiftly calculates the mass of alcohol (in grams) contained in a given volume of a beverage (in milliliters) when alcohol content (Vol.-% or v/v) is known.\n\nIt uses the formula: mass (g) = volume (mL) * Vol-%/100 * specific weight of alcohol (0.793 g/mL)\n\n<b>Features:<b>\n\n* 🖩 <strong>Calculate mass, or volume, or content (v/v)</strong> of an alcoholic beverage by entering the 2 other data points.\n* 🎨 <strong>Intuitive Interface</strong> - Clear buttons and layout, simple to understand.\n* 🔄 <strong>Dynamic Field Adjustments</strong> - Modify any data field post-calculation, and the app will update the other relevant fields (right now function via pressing \"Calculate\" again after modifying fields).\n* 🚨 <strong>Plausibility Warnings</strong> - The screen will flash red if any of the values are totally out of place, such as above 100% alcohol content or volumes above 10 liters, informing the user that something probably went wrong. Calculation still finishes.\n* <strong>Localization</strong> - Right now: English, German\n\n<b>Usage:<b>\n1. Enter your data in any 2 of the 3 fields\n2. Tap \"Calculate\"\n3. View your results\n4. To clear all 3 fields, tap the \"clear\" Button.\n\n🚨DISCLAIMER🚨: This is NOT a medical application NOR a medical product. This is just a calculator. Correct results are not guaranteed. User is responsible for checking results and plausibility.\n\nCreated with ❤️ by Valentin. \nTags: calculator, alcoholic solution, volume percent, v/v, Volumenprozent, Volumenprozentrechner, Alkoholgehalt, alcohol content, mass of alcohol (grams), specific weigth, spezifisches Gewicht, Normalbedingungen.\n","repo":{"author":"Valentin","repo":"https://github.com/v4lpt/VPC"},"version":"021a9569155e9fa4cf6df22a4a87f8ae15937b54a2b352890e6c896d0b535130","site":null,"source":"https://github.com/v4lpt/VPC","license_or_tos":"GPL-3.0-only","resources":null,"verified":false}